zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
/*
 * Copyright (c) 2016 BayLibre, SAS
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_spi

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(spi_stm32, CONFIG_SPI_LOG_LEVEL);

#include <zephyr/cache.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/spi.h>
#include "spi_rtio.h"
#include <zephyr/dt-bindings/memory-attr/memory-attr-arm.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/linker/linker-defs.h>
#include <zephyr/mem_mgmt/mem_attr.h>
#include <zephyr/pm/policy.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/rtio/rtio.h>
#include <zephyr/sys/util.h>
#include <zephyr/toolchain.h>

#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_cache.h>
#include <stm32_ll_spi.h>

#include <errno.h>

#include "spi_stm32.h"

#ifdef CONFIG_STM32_HAL2
#define STM32_SPI_BAUD_RATE_PRESCALER_256	LL_SPI_BAUD_RATE_PRESCALER_256
#define STM32_SPI_BAUD_RATE_PRESCALER_128	LL_SPI_BAUD_RATE_PRESCALER_128
#define STM32_SPI_BAUD_RATE_PRESCALER_64	LL_SPI_BAUD_RATE_PRESCALER_64
#define STM32_SPI_BAUD_RATE_PRESCALER_32	LL_SPI_BAUD_RATE_PRESCALER_32
#define STM32_SPI_BAUD_RATE_PRESCALER_16	LL_SPI_BAUD_RATE_PRESCALER_16
#define STM32_SPI_BAUD_RATE_PRESCALER_8		LL_SPI_BAUD_RATE_PRESCALER_8
#define STM32_SPI_BAUD_RATE_PRESCALER_4		LL_SPI_BAUD_RATE_PRESCALER_4
#define STM32_SPI_BAUD_RATE_PRESCALER_2		LL_SPI_BAUD_RATE_PRESCALER_2
#define STM32_SPI_BAUD_RATE_PRESCALER_BYPASS	LL_SPI_BAUD_RATE_PRESCALER_BYPASS
#define STM32_SPI_CLOCK_POLARITY_HIGH		LL_SPI_CLOCK_POLARITY_HIGH
#define STM32_SPI_CLOCK_POLARITY_LOW		LL_SPI_CLOCK_POLARITY_LOW
#define STM32_SPI_CLOCK_PHASE_1_EDGE		LL_SPI_CLOCK_PHASE_1_EDGE
#define STM32_SPI_CLOCK_PHASE_2_EDGE		LL_SPI_CLOCK_PHASE_2_EDGE
#define STM32_SPI_HALF_DUPLEX_RX		(LL_SPI_HALF_DUPLEX | LL_SPI_HALF_DUPLEX_RX)
#define STM32_SPI_HALF_DUPLEX_TX		(LL_SPI_HALF_DUPLEX | LL_SPI_HALF_DUPLEX_TX)
#define STM32_SPI_DATA_WIDTH_4_BIT		LL_SPI_DATA_WIDTH_4_BIT
#define STM32_SPI_DATA_WIDTH_5_BIT		LL_SPI_DATA_WIDTH_5_BIT
#define STM32_SPI_DATA_WIDTH_6_BIT		LL_SPI_DATA_WIDTH_6_BIT
#define STM32_SPI_DATA_WIDTH_7_BIT		LL_SPI_DATA_WIDTH_7_BIT
#define STM32_SPI_DATA_WIDTH_8_BIT		LL_SPI_DATA_WIDTH_8_BIT
#define STM32_SPI_DATA_WIDTH_9_BIT		LL_SPI_DATA_WIDTH_9_BIT
#define STM32_SPI_DATA_WIDTH_10_BIT		LL_SPI_DATA_WIDTH_10_BIT
#define STM32_SPI_DATA_WIDTH_11_BIT		LL_SPI_DATA_WIDTH_11_BIT
#define STM32_SPI_DATA_WIDTH_12_BIT		LL_SPI_DATA_WIDTH_12_BIT
#define STM32_SPI_DATA_WIDTH_13_BIT		LL_SPI_DATA_WIDTH_13_BIT
#define STM32_SPI_DATA_WIDTH_14_BIT		LL_SPI_DATA_WIDTH_14_BIT
#define STM32_SPI_DATA_WIDTH_15_BIT		LL_SPI_DATA_WIDTH_15_BIT
#define STM32_SPI_DATA_WIDTH_16_BIT		LL_SPI_DATA_WIDTH_16_BIT
#define STM32_SPI_DATA_WIDTH_17_BIT		LL_SPI_DATA_WIDTH_17_BIT
#define STM32_SPI_DATA_WIDTH_18_BIT		LL_SPI_DATA_WIDTH_18_BIT
#define STM32_SPI_DATA_WIDTH_19_BIT		LL_SPI_DATA_WIDTH_19_BIT
#define STM32_SPI_DATA_WIDTH_20_BIT		LL_SPI_DATA_WIDTH_20_BIT
#define STM32_SPI_DATA_WIDTH_21_BIT		LL_SPI_DATA_WIDTH_21_BIT
#define STM32_SPI_DATA_WIDTH_22_BIT		LL_SPI_DATA_WIDTH_22_BIT
#define STM32_SPI_DATA_WIDTH_23_BIT		LL_SPI_DATA_WIDTH_23_BIT
#define STM32_SPI_DATA_WIDTH_24_BIT		LL_SPI_DATA_WIDTH_24_BIT
#define STM32_SPI_DATA_WIDTH_25_BIT		LL_SPI_DATA_WIDTH_25_BIT
#define STM32_SPI_DATA_WIDTH_26_BIT		LL_SPI_DATA_WIDTH_26_BIT
#define STM32_SPI_DATA_WIDTH_27_BIT		LL_SPI_DATA_WIDTH_27_BIT
#define STM32_SPI_DATA_WIDTH_28_BIT		LL_SPI_DATA_WIDTH_28_BIT
#define STM32_SPI_DATA_WIDTH_29_BIT		LL_SPI_DATA_WIDTH_29_BIT
#define STM32_SPI_DATA_WIDTH_30_BIT		LL_SPI_DATA_WIDTH_30_BIT
#define STM32_SPI_DATA_WIDTH_31_BIT		LL_SPI_DATA_WIDTH_31_BIT
#define STM32_SPI_DATA_WIDTH_32_BIT		LL_SPI_DATA_WIDTH_32_BIT
#define STM32_SPI_FIFO_THRESHOLD_1_DATA		LL_SPI_FIFO_THRESHOLD_1_DATA
#define STM32_SPI_FIFO_THRESHOLD_2_DATA		LL_SPI_FIFO_THRESHOLD_2_DATA
#define STM32_SPI_FIFO_THRESHOLD_3_DATA		LL_SPI_FIFO_THRESHOLD_3_DATA
#define STM32_SPI_FIFO_THRESHOLD_4_DATA		LL_SPI_FIFO_THRESHOLD_4_DATA
#define STM32_SPI_FIFO_THRESHOLD_5_DATA		LL_SPI_FIFO_THRESHOLD_5_DATA
#define STM32_SPI_FIFO_THRESHOLD_6_DATA		LL_SPI_FIFO_THRESHOLD_6_DATA
#define STM32_SPI_FIFO_THRESHOLD_7_DATA		LL_SPI_FIFO_THRESHOLD_7_DATA
#define STM32_SPI_FIFO_THRESHOLD_8_DATA		LL_SPI_FIFO_THRESHOLD_8_DATA
#define STM32_SPI_FIFO_THRESHOLD_9_DATA		LL_SPI_FIFO_THRESHOLD_9_DATA
#define STM32_SPI_FIFO_THRESHOLD_10_DATA	LL_SPI_FIFO_THRESHOLD_10_DATA
#define STM32_SPI_FIFO_THRESHOLD_11_DATA	LL_SPI_FIFO_THRESHOLD_11_DATA
#define STM32_SPI_FIFO_THRESHOLD_12_DATA	LL_SPI_FIFO_THRESHOLD_12_DATA
#define STM32_SPI_FIFO_THRESHOLD_13_DATA	LL_SPI_FIFO_THRESHOLD_13_DATA
#define STM32_SPI_FIFO_THRESHOLD_14_DATA	LL_SPI_FIFO_THRESHOLD_14_DATA
#define STM32_SPI_FIFO_THRESHOLD_15_DATA	LL_SPI_FIFO_THRESHOLD_15_DATA
#define STM32_SPI_FIFO_THRESHOLD_16_DATA	LL_SPI_FIFO_THRESHOLD_16_DATA
#define STM32_SPI_FLAG_UDR			LL_SPI_FLAG_UDR
#define STM32_SPI_FLAG_CRCE			LL_SPI_FLAG_CRCE
#define STM32_SPI_FLAG_MODF			LL_SPI_FLAG_MODF
#define STM32_SPI_FLAG_OVR			LL_SPI_FLAG_OVR
#define STM32_SPI_FLAG_TIFRE			LL_SPI_FLAG_TIFRE
#else /* CONFIG_STM32_HAL2 */
#define STM32_SPI_BAUD_RATE_PRESCALER_256	LL_SPI_BAUDRATEPRESCALER_DIV256
#define STM32_SPI_BAUD_RATE_PRESCALER_128	LL_SPI_BAUDRATEPRESCALER_DIV128
#define STM32_SPI_BAUD_RATE_PRESCALER_64	LL_SPI_BAUDRATEPRESCALER_DIV64
#define STM32_SPI_BAUD_RATE_PRESCALER_32	LL_SPI_BAUDRATEPRESCALER_DIV32
#define STM32_SPI_BAUD_RATE_PRESCALER_16	LL_SPI_BAUDRATEPRESCALER_DIV16
#define STM32_SPI_BAUD_RATE_PRESCALER_8		LL_SPI_BAUDRATEPRESCALER_DIV8
#define STM32_SPI_BAUD_RATE_PRESCALER_4		LL_SPI_BAUDRATEPRESCALER_DIV4
#define STM32_SPI_BAUD_RATE_PRESCALER_2		LL_SPI_BAUDRATEPRESCALER_DIV2
#ifdef LL_SPI_BAUDRATEPRESCALER_BYPASS
#define STM32_SPI_BAUD_RATE_PRESCALER_BYPASS	LL_SPI_BAUDRATEPRESCALER_BYPASS
#endif
#define STM32_SPI_DATA_WIDTH_16_BIT		LL_SPI_DATAWIDTH_16BIT
#define STM32_SPI_DATA_WIDTH_8_BIT		LL_SPI_DATAWIDTH_8BIT
#define STM32_SPI_CLOCK_POLARITY_LOW		LL_SPI_POLARITY_LOW
#define STM32_SPI_CLOCK_POLARITY_HIGH		LL_SPI_POLARITY_HIGH
#define STM32_SPI_CLOCK_PHASE_1_EDGE		LL_SPI_PHASE_1EDGE
#define STM32_SPI_CLOCK_PHASE_2_EDGE		LL_SPI_PHASE_2EDGE
#define STM32_SPI_HALF_DUPLEX_RX		LL_SPI_HALF_DUPLEX_RX
#define STM32_SPI_HALF_DUPLEX_TX		LL_SPI_HALF_DUPLEX_TX
#define STM32_SPI_DATA_WIDTH_8_BIT		LL_SPI_DATAWIDTH_8BIT
#define STM32_SPI_DATA_WIDTH_16_BIT		LL_SPI_DATAWIDTH_16BIT
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_fifo)
#define STM32_SPI_DATA_WIDTH_4_BIT		LL_SPI_DATAWIDTH_4BIT
#define STM32_SPI_DATA_WIDTH_5_BIT		LL_SPI_DATAWIDTH_5BIT
#define STM32_SPI_DATA_WIDTH_6_BIT		LL_SPI_DATAWIDTH_6BIT
#define STM32_SPI_DATA_WIDTH_7_BIT		LL_SPI_DATAWIDTH_7BIT
#define STM32_SPI_DATA_WIDTH_9_BIT		LL_SPI_DATAWIDTH_9BIT
#define STM32_SPI_DATA_WIDTH_10_BIT		LL_SPI_DATAWIDTH_10BIT
#define STM32_SPI_DATA_WIDTH_11_BIT		LL_SPI_DATAWIDTH_11BIT
#define STM32_SPI_DATA_WIDTH_12_BIT		LL_SPI_DATAWIDTH_12BIT
#define STM32_SPI_DATA_WIDTH_13_BIT		LL_SPI_DATAWIDTH_13BIT
#define STM32_SPI_DATA_WIDTH_14_BIT		LL_SPI_DATAWIDTH_14BIT
#define STM32_SPI_DATA_WIDTH_15_BIT		LL_SPI_DATAWIDTH_15BIT
#endif /* st_stm32_spi_fifo */
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
#define STM32_SPI_DATA_WIDTH_17_BIT		LL_SPI_DATAWIDTH_17BIT
#define STM32_SPI_DATA_WIDTH_18_BIT		LL_SPI_DATAWIDTH_18BIT
#define STM32_SPI_DATA_WIDTH_19_BIT		LL_SPI_DATAWIDTH_19BIT
#define STM32_SPI_DATA_WIDTH_20_BIT		LL_SPI_DATAWIDTH_20BIT
#define STM32_SPI_DATA_WIDTH_21_BIT		LL_SPI_DATAWIDTH_21BIT
#define STM32_SPI_DATA_WIDTH_22_BIT		LL_SPI_DATAWIDTH_22BIT
#define STM32_SPI_DATA_WIDTH_23_BIT		LL_SPI_DATAWIDTH_23BIT
#define STM32_SPI_DATA_WIDTH_24_BIT		LL_SPI_DATAWIDTH_24BIT
#define STM32_SPI_DATA_WIDTH_25_BIT		LL_SPI_DATAWIDTH_25BIT
#define STM32_SPI_DATA_WIDTH_26_BIT		LL_SPI_DATAWIDTH_26BIT
#define STM32_SPI_DATA_WIDTH_27_BIT		LL_SPI_DATAWIDTH_27BIT
#define STM32_SPI_DATA_WIDTH_28_BIT		LL_SPI_DATAWIDTH_28BIT
#define STM32_SPI_DATA_WIDTH_29_BIT		LL_SPI_DATAWIDTH_29BIT
#define STM32_SPI_DATA_WIDTH_30_BIT		LL_SPI_DATAWIDTH_30BIT
#define STM32_SPI_DATA_WIDTH_31_BIT		LL_SPI_DATAWIDTH_31BIT
#define STM32_SPI_DATA_WIDTH_32_BIT		LL_SPI_DATAWIDTH_32BIT
#define STM32_SPI_FIFO_THRESHOLD_1_DATA		LL_SPI_FIFO_TH_01DATA
#define STM32_SPI_FIFO_THRESHOLD_2_DATA		LL_SPI_FIFO_TH_02DATA
#define STM32_SPI_FIFO_THRESHOLD_3_DATA		LL_SPI_FIFO_TH_03DATA
#define STM32_SPI_FIFO_THRESHOLD_4_DATA		LL_SPI_FIFO_TH_04DATA
#define STM32_SPI_FIFO_THRESHOLD_5_DATA		LL_SPI_FIFO_TH_05DATA
#define STM32_SPI_FIFO_THRESHOLD_6_DATA		LL_SPI_FIFO_TH_06DATA
#define STM32_SPI_FIFO_THRESHOLD_7_DATA		LL_SPI_FIFO_TH_07DATA
#define STM32_SPI_FIFO_THRESHOLD_8_DATA		LL_SPI_FIFO_TH_08DATA
#define STM32_SPI_FIFO_THRESHOLD_9_DATA		LL_SPI_FIFO_TH_09DATA
#define STM32_SPI_FIFO_THRESHOLD_10_DATA	LL_SPI_FIFO_TH_10DATA
#define STM32_SPI_FIFO_THRESHOLD_11_DATA	LL_SPI_FIFO_TH_11DATA
#define STM32_SPI_FIFO_THRESHOLD_12_DATA	LL_SPI_FIFO_TH_12DATA
#define STM32_SPI_FIFO_THRESHOLD_13_DATA	LL_SPI_FIFO_TH_13DATA
#define STM32_SPI_FIFO_THRESHOLD_14_DATA	LL_SPI_FIFO_TH_14DATA
#define STM32_SPI_FIFO_THRESHOLD_15_DATA	LL_SPI_FIFO_TH_15DATA
#define STM32_SPI_FIFO_THRESHOLD_16_DATA	LL_SPI_FIFO_TH_16DATA
#define STM32_SPI_FLAG_UDR			LL_SPI_SR_UDR
#define STM32_SPI_FLAG_CRCE			LL_SPI_SR_CRCE
#define STM32_SPI_FLAG_MODF			LL_SPI_SR_MODF
#define STM32_SPI_FLAG_OVR			LL_SPI_SR_OVR
#define STM32_SPI_FLAG_TIFRE			LL_SPI_SR_TIFRE
#endif /* st_stm32h7_spi */
#endif /* CONFIG_STM32_HAL2 */

#define STM32_SPI_FULL_DUPLEX			LL_SPI_FULL_DUPLEX
#define STM32_SPI_SIMPLEX_RX			LL_SPI_SIMPLEX_RX
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
#define STM32_SPI_SIMPLEX_TX			LL_SPI_SIMPLEX_TX
#endif

#if defined(CONFIG_DCACHE) && !defined(CONFIG_NOCACHE_MEMORY)
/* currently, manual cache coherency management is only done on dummy_rx_tx_buffer */
#define SPI_STM32_MANUAL_CACHE_COHERENCY_REQUIRED	1
#else
#define SPI_STM32_MANUAL_CACHE_COHERENCY_REQUIRED	0
#endif /* defined(CONFIG_DCACHE) && !defined(CONFIG_NOCACHE_MEMORY) */

#define WAIT_1US	1U

