zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
/*
 * Check for SPI_SR_FRE to determine support for TI mode frame format
 * error flag, because STM32F1 SoCs do not support it and STM32CUBE
 * for F1 family defines an unused LL_SPI_SR_FRE.
 */
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
#define SPI_STM32_ERR_MSK (STM32_SPI_FLAG_UDR | STM32_SPI_FLAG_CRCE | STM32_SPI_FLAG_MODF | \
			   STM32_SPI_FLAG_OVR | STM32_SPI_FLAG_TIFRE)
#else /* st_stm32h7_spi */
#if defined(LL_SPI_SR_UDR)
#define SPI_STM32_ERR_MSK (LL_SPI_SR_UDR | LL_SPI_SR_CRCERR | LL_SPI_SR_MODF | \
			   LL_SPI_SR_OVR | LL_SPI_SR_FRE)
#elif defined(SPI_SR_FRE)
#define SPI_STM32_ERR_MSK (LL_SPI_SR_CRCERR | LL_SPI_SR_MODF | \
			   LL_SPI_SR_OVR | LL_SPI_SR_FRE)
#else
#define SPI_STM32_ERR_MSK (LL_SPI_SR_CRCERR | LL_SPI_SR_MODF | LL_SPI_SR_OVR)
#endif
#endif /* st_stm32h7_spi */


#define ANY_SPI_DATA_WIDTH_IS(value) \
	(DT_INST_FOREACH_STATUS_OKAY_VARGS(IS_EQ_STRING_PROP, \
					   st_spi_data_width,\
					   value, STM32_SPI_DATA_WIDTH_) 0)

#define IS_EQ_STRING_PROP(inst, prop, compare_value, prefix) \
	IS_EQ(CONCAT(prefix, DT_INST_STRING_UPPER_TOKEN(inst, prop)), compare_value) ||

	/* Data width supported */
#define STM32_SPI_DATA_WIDTH_FULL_4_TO_32_BIT	1
#define STM32_SPI_DATA_WIDTH_FULL_4_TO_16_BIT	2
#define STM32_SPI_DATA_WIDTH_LIMITED_8_16_BIT	3

#if ANY_SPI_DATA_WIDTH_IS(STM32_SPI_DATA_WIDTH_FULL_4_TO_32_BIT) || \
	ANY_SPI_DATA_WIDTH_IS(STM32_SPI_DATA_WIDTH_FULL_4_TO_16_BIT)

#define STM32_SPI_DATA_WIDTH_MIN	4

#if ANY_SPI_DATA_WIDTH_IS(STM32_SPI_DATA_WIDTH_FULL_4_TO_32_BIT)
#define STM32_SPI_DATA_WIDTH_MAX	32
#else
#define STM32_SPI_DATA_WIDTH_MAX	16
#endif

/* These macros are used to create a table containing all supported data widths,
 * LL_SPI_DATAWIDTH_x_BIT, with x ranging from 4 to 16 or 32 depending on series.
 */
#define STM32_SPI_DATA_WIDTH(i, _)								\
	CONCAT(STM32_SPI_DATA_WIDTH_, UTIL_INC(UTIL_INC(UTIL_INC(UTIL_INC(i)))), _BIT)
static const uint32_t table_datawidth[] = {
	LISTIFY(UTIL_DEC(UTIL_DEC(UTIL_DEC(STM32_SPI_DATA_WIDTH_MAX))), STM32_SPI_DATA_WIDTH, (,))
};

#else /* ANY FULL_32 || FULL_16 */

static const uint32_t table_datawidth[] = {
	STM32_SPI_DATA_WIDTH_8_BIT,
	STM32_SPI_DATA_WIDTH_16_BIT,
};

#endif /* ANY FULL_32 || FULL_16 */

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
#define STM32_SPI_FIFO_THRESHOLD_MAX	16
#define STM32_SPI_FIFO_THRESHOLD(i, _)	CONCAT(STM32_SPI_FIFO_THRESHOLD_, UTIL_INC(i), _DATA)
static const uint32_t table_fifo_threshold[] = {
	LISTIFY(STM32_SPI_FIFO_THRESHOLD_MAX, STM32_SPI_FIFO_THRESHOLD, (,))
};
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

static bool spi_stm32_is_data_width_supported(const struct device *dev, uint32_t width)
{
	const struct spi_stm32_config *cfg = dev->config;

	switch (cfg->datawidth) {
	case STM32_SPI_DATA_WIDTH_FULL_4_TO_32_BIT:
		return IN_RANGE(width, 4, 32);

	case STM32_SPI_DATA_WIDTH_FULL_4_TO_16_BIT:
		return IN_RANGE(width, 4, 16);

	case STM32_SPI_DATA_WIDTH_LIMITED_8_16_BIT:
		return (width == 8) || (width == 16);

	default:
		LOG_ERR("No data width defined for this instance");
		return false;
	}
}

static void spi_stm32_pm_policy_state_lock_get(const struct device *dev)
{
	if (IS_ENABLED(CONFIG_PM)) {
		struct spi_stm32_data *data = dev->data;

		if (!data->pm_policy_state_on) {
			data->pm_policy_state_on = true;
			pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
			if (IS_ENABLED(CONFIG_PM_S2RAM)) {
				pm_policy_state_lock_get(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
			}
			pm_device_runtime_get(dev);
		}
	}
}

static void spi_stm32_pm_policy_state_lock_put(const struct device *dev)
{
	if (IS_ENABLED(CONFIG_PM)) {
		struct spi_stm32_data *data = dev->data;

		if (data->pm_policy_state_on) {
			data->pm_policy_state_on = false;
			pm_device_runtime_put(dev);
			pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_IDLE, PM_ALL_SUBSTATES);
			if (IS_ENABLED(CONFIG_PM_S2RAM)) {
				pm_policy_state_lock_put(PM_STATE_SUSPEND_TO_RAM, PM_ALL_SUBSTATES);
			}
		}
	}
}

static uint8_t bits2bytes(spi_operation_t operation)
{
	uint32_t bits = SPI_WORD_SIZE_GET(operation);

	if (bits <= 8U) {
		return 1U;
	} else if (bits <= 16U) {
		return 2U;
	} else {
		return 4U;
	}
}

#ifdef CONFIG_SPI_STM32_DMA
/* dummy buffer is used for transferring NOP when tx buf is null
 * and used as a dummy sink for when rx buf is null.
 */
/*
 * If Nocache Memory is supported, buffer will be placed in nocache region by
 * the linker to avoid potential DMA cache-coherency problems.
 * If Nocache Memory is not supported, cache coherency might need to be kept
 * manually. See SPI_STM32_MANUAL_CACHE_COHERENCY_REQUIRED.
 */
static __aligned(32) uint32_t dummy_rx_tx_buffer __nocache;

static int spi_stm32_dma_tx_load(const struct device *dev, const uint8_t *buf, size_t len)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	struct dma_block_config *blk_cfg;
	int ret;

	/* remember active TX DMA channel (used in callback) */
	struct stream *stream = &data->dma_tx;

	blk_cfg = &stream->dma_blk_cfg;

	/* prepare the block for this TX DMA channel */
	memset(blk_cfg, 0, sizeof(struct dma_block_config));
	blk_cfg->block_size = len;

	/* tx direction has memory as source and periph as dest. */
	if (buf == NULL || len == 0) {
		/* if tx buff is null, then sends NOP on the line. */
		dummy_rx_tx_buffer = 0;
#if SPI_STM32_MANUAL_CACHE_COHERENCY_REQUIRED
		sys_cache_data_flush_range((void *)&dummy_rx_tx_buffer, sizeof(uint32_t));
#endif /* SPI_STM32_MANUAL_CACHE_COHERENCY_REQUIRED */
		blk_cfg->source_address = (uint32_t)&dummy_rx_tx_buffer;
		blk_cfg->source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	} else {
		blk_cfg->source_address = (uint32_t)buf;
		if (data->dma_tx.src_addr_increment) {
			blk_cfg->source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		} else {
			blk_cfg->source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		}
	}

	blk_cfg->dest_address = ll_dma_get_reg_addr(cfg->spi, SPI_STM32_DMA_TX);
	/* fifo mode NOT USED there */
	if (data->dma_tx.dst_addr_increment) {
		blk_cfg->dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
	} else {
		blk_cfg->dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	}

