zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
	/* give the fifo mode from the DT */
	blk_cfg->fifo_mode_control = data->dma_tx.fifo_threshold;

	/* direction is given by the DT */
	stream->dma_cfg.head_block = blk_cfg;
	/* Pass SPI device as callback context */
	stream->dma_cfg.user_data = (void *)dev;
	/* pass our client origin to the dma: data->dma_tx.dma_channel */
	ret = dma_config(data->dma_tx.dma_dev, data->dma_tx.channel, &stream->dma_cfg);
	/* the channel is the actual stream from 0 */
	if (ret != 0) {
		return ret;
	}

	/* gives the request ID to the dma mux */
	return dma_start(data->dma_tx.dma_dev, data->dma_tx.channel);
}

static int spi_stm32_dma_rx_load(const struct device *dev, uint8_t *buf, size_t len)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	struct dma_block_config *blk_cfg;
	int ret;

	/* retrieve active RX DMA channel (used in callback) */
	struct stream *stream = &data->dma_rx;

	blk_cfg = &stream->dma_blk_cfg;

	/* prepare the block for this RX DMA channel */
	memset(blk_cfg, 0, sizeof(struct dma_block_config));
	blk_cfg->block_size = len;


	/* rx direction has periph as source and mem as dest. */
	if (buf == NULL || len == 0) {
		/* if rx buff is null, then write data to dummy address. */
		blk_cfg->dest_address = (uint32_t)&dummy_rx_tx_buffer;
		blk_cfg->dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	} else {
		blk_cfg->dest_address = (uint32_t)buf;
		if (data->dma_rx.dst_addr_increment) {
			blk_cfg->dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		} else {
			blk_cfg->dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		}
	}

	blk_cfg->source_address = ll_dma_get_reg_addr(cfg->spi, SPI_STM32_DMA_RX);
	if (data->dma_rx.src_addr_increment) {
		blk_cfg->source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
	} else {
		blk_cfg->source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
	}

	/* give the fifo mode from the DT */
	blk_cfg->fifo_mode_control = data->dma_rx.fifo_threshold;

	/* direction is given by the DT */
	stream->dma_cfg.head_block = blk_cfg;
	stream->dma_cfg.user_data = (void *)dev;


	/* pass our client origin to the dma: data->dma_rx.channel */
	ret = dma_config(data->dma_rx.dma_dev, data->dma_rx.channel, &stream->dma_cfg);
	/* the channel is the actual stream from 0 */
	if (ret != 0) {
		return ret;
	}

	/* gives the request ID to the dma mux */
	return dma_start(data->dma_rx.dma_dev, data->dma_rx.channel);
}

static int spi_dma_move_rx_buffers(const struct device *dev, size_t len)
{
	struct spi_stm32_data *data = dev->data;
	size_t dma_segment_len;

	dma_segment_len = len * data->dma_rx.dma_cfg.dest_data_size;
	return spi_stm32_dma_rx_load(dev, data->ctx.rx_buf, dma_segment_len);
}

static int spi_dma_move_tx_buffers(const struct device *dev, size_t len)
{
	struct spi_stm32_data *data = dev->data;
	size_t dma_segment_len;

	dma_segment_len = len * data->dma_tx.dma_cfg.source_data_size;
	return spi_stm32_dma_tx_load(dev, data->ctx.tx_buf, dma_segment_len);
}

static int spi_dma_move_buffers(const struct device *dev, size_t len)
{
	int ret;

	ret = spi_dma_move_rx_buffers(dev, len);

	if (ret != 0) {
		return ret;
	}

	return spi_dma_move_tx_buffers(dev, len);
}

static void spi_dma_enable_requests(SPI_TypeDef *spi)
{
	uint32_t transfer_dir = ll_get_transfer_direction(spi);

	if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
		LL_SPI_EnableDMAReq_RX(spi);
		LL_SPI_EnableDMAReq_TX(spi);
	} else if (transfer_dir == STM32_SPI_HALF_DUPLEX_TX) {
		LL_SPI_EnableDMAReq_TX(spi);
	} else {
		LL_SPI_EnableDMAReq_RX(spi);
	}
}

static void spi_stm32_dma_tx_done(const struct device *dev)
{
	const struct spi_stm32_config *cfg = dev->config;
	__maybe_unused SPI_TypeDef *spi = cfg->spi;

#ifdef SPI_SR_FTLVL
	while (LL_SPI_GetTxFIFOLevel(spi) > 0) {
	}
#endif /* SPI_SR_FTLVL */
}

static void spi_stm32_dma_rx_done(const struct device *dev, const struct spi_config *config)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	SPI_TypeDef *spi = cfg->spi;
	__maybe_unused uint8_t dfs = bits2bytes(config->operation);
	__maybe_unused uint32_t transfer_dir = LL_SPI_GetTransferDirection(spi);

#ifdef CONFIG_SPI_STM32_ERRATA_BUSY
	(void)WAIT_FOR(!ll_spi_dma_busy(spi), CONFIG_SPI_STM32_BUSY_FLAG_TIMEOUT, k_yield());
#else
	/* wait until spi is no more busy */
	while (ll_spi_dma_busy(spi) && LL_SPI_IsEnabled(spi)) {
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		uint32_t width = SPI_WORD_SIZE_GET(data->ctx.config->operation);
		/* The TXC flag is not raised at the end of a 9, 17 or 25 bit transfer.
		 * In that case, just break the loop, transfer should be done anyway.
		 */
		if ((width == 9U) || (width == 17U) || (width == 25U)) {
			break;
		}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */
	}
#endif /* CONFIG_SPI_STM32_ERRATA_BUSY */

#ifndef CONFIG_SPI_RTIO
	if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
		spi_context_update_tx(&data->ctx, dfs, data->tx_len);
		spi_context_update_rx(&data->ctx, dfs, data->rx_len);
	} else if (transfer_dir == STM32_SPI_HALF_DUPLEX_TX) {
		spi_context_update_tx(&data->ctx, dfs, data->tx_len);
	} else {
		spi_context_update_rx(&data->ctx, dfs, data->rx_len);
	}
#endif /* !CONFIG_SPI_RTIO */

	data->tx_len = data->rx_len = 0U;
}
#endif /* CONFIG_SPI_STM32_DMA */

/* Value to shift out when no application data needs transmitting. */
#define SPI_STM32_TX_NOP 0x00

static uint8_t spi_stm32_send_next_frame(SPI_TypeDef *spi, struct spi_stm32_data *data,
					 uint8_t fifo_space)
{
	const uint8_t dfs = bits2bytes(data->ctx.config->operation);
	uint32_t tx_frame = SPI_STM32_TX_NOP;
	uint8_t len;

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (dfs == 4U ||
	    (dfs == 2U && fifo_space >= 2U && data->ctx.tx_len >= 2) ||
	    (dfs == 1U && fifo_space >= 4U && data->ctx.tx_len >= 4)) {
		if (spi_context_tx_buf_on(&data->ctx)) {
			tx_frame = UNALIGNED_GET((uint32_t *)(data->ctx.tx_buf));
		}
		LL_SPI_TransmitData32(spi, tx_frame);
		len = 4U / dfs;
	} else {
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */
		if (dfs == 2U ||
		    (dfs == 1U && fifo_space >= 2U && data->ctx.tx_len >= 2)) {
			if (spi_context_tx_buf_on(&data->ctx)) {
				tx_frame = UNALIGNED_GET((uint16_t *)(data->ctx.tx_buf));
			}
			LL_SPI_TransmitData16(spi, tx_frame);
			len = 2U / dfs;
		} else {
			if (spi_context_tx_buf_on(&data->ctx)) {
				tx_frame = *((uint8_t *)(data->ctx.tx_buf));
			}
			LL_SPI_TransmitData8(spi, tx_frame);
			len = 1U;
		}
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

