zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
	if (spi_context_tx_on(&data->ctx)) {
		spi_context_update_tx(&data->ctx, dfs, len);
	}
	return len;
}

static uint8_t spi_stm32_read_next_frame(SPI_TypeDef *spi, struct spi_stm32_data *data,
					 uint8_t fifo_space)
{
	const uint8_t dfs = bits2bytes(data->ctx.config->operation);
	uint32_t rx_frame = 0;
	uint8_t len;

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (dfs == 4U ||
	    (dfs == 2U && fifo_space >= 2U && data->ctx.rx_len >= 2) ||
	    (dfs == 1U && fifo_space >= 4U && data->ctx.rx_len >= 4)) {
		rx_frame = LL_SPI_ReceiveData32(spi);
		if (spi_context_rx_buf_on(&data->ctx)) {
			UNALIGNED_PUT(rx_frame, (uint32_t *)data->ctx.rx_buf);
		}
		len = 4U / dfs;
	} else {
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */
		if (dfs == 2U ||
		    (dfs == 1U && fifo_space >= 2U && data->ctx.rx_len >= 2)) {
			rx_frame = LL_SPI_ReceiveData16(spi);
			if (spi_context_rx_buf_on(&data->ctx)) {
				UNALIGNED_PUT(rx_frame, (uint16_t *)data->ctx.rx_buf);
			}
			len = 2U / dfs;
		} else {
			rx_frame = LL_SPI_ReceiveData8(spi);
			if (spi_context_rx_buf_on(&data->ctx)) {
				UNALIGNED_PUT(rx_frame, (uint8_t *)data->ctx.rx_buf);
			}
			len = 1U;
		}
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	if (spi_context_rx_on(&data->ctx)) {
		spi_context_update_rx(&data->ctx, dfs, len);
	}
	return len;
}

static bool spi_stm32_transfer_ongoing(struct spi_stm32_data *data)
{
	return spi_context_tx_on(&data->ctx) || spi_context_rx_on(&data->ctx) ||
		data->tx_len != 0U || data->rx_len != 0U;
}

static int spi_stm32_get_err(SPI_TypeDef *spi)
{
	uint32_t sr = stm32_reg_read(&spi->SR);

	if ((sr & SPI_STM32_ERR_MSK) != 0U) {
		LOG_ERR("%s: err=%d", __func__, sr & (uint32_t)SPI_STM32_ERR_MSK);

		/* OVR error must be explicitly cleared */
		if (LL_SPI_IsActiveFlag_OVR(spi)) {
			LL_SPI_ClearFlag_OVR(spi);
		}

		return -EIO;
	}

	return 0;
}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
static void spi_stm32_send_fifo(SPI_TypeDef *spi, struct spi_stm32_data *data)
{
	uint8_t nb_sent;
	uint8_t fifo_space = data->fifo_threshold;

	do {
		nb_sent = spi_stm32_send_next_frame(spi, data, fifo_space);
		data->tx_len -= nb_sent;
		fifo_space -= nb_sent;
	} while (fifo_space > 0U && data->tx_len > 0U);
}

static void spi_stm32_read_fifo(SPI_TypeDef *spi, struct spi_stm32_data *data)
{
	uint8_t nb_read;
	uint8_t fifo_space = data->fifo_threshold;

	do {
		nb_read = spi_stm32_read_next_frame(spi, data, fifo_space);
		data->rx_len -= nb_read;
		fifo_space -= nb_read;
	} while (fifo_space > 0U && data->rx_len > 0U);
}

static int spi_stm32_shift_fifo(SPI_TypeDef *spi, struct spi_stm32_data *data)
{
	uint32_t transfer_dir = ll_get_transfer_direction(spi);

	if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
		if (LL_SPI_IsActiveFlag_DXP(spi) && data->tx_len != 0U && data->rx_len != 0U) {
			/* Complete data packet is available and complete data packet can be sent.
			 * First read the RxFIFO until threshold is reached then fill the TxFIFO
			 * until threshold is reached or all data for the transfer are sent.
			 * The order is important to prevent overruns. This allows using the FIFOs
			 * to their full capacity.
			 */
			spi_stm32_read_fifo(spi, data);
			spi_stm32_send_fifo(spi, data);
		}
	} else if (transfer_dir == STM32_SPI_HALF_DUPLEX_RX) {
		if (ll_rx_is_not_empty(spi) && data->rx_len != 0U) {
			/* Complete data packet is available.
			 * Read the RxFIFO until threshold is reached.
			 */
			spi_stm32_read_fifo(spi, data);
		}
	} else if (transfer_dir == STM32_SPI_HALF_DUPLEX_TX) {
		if (ll_tx_is_not_full(spi) && data->tx_len != 0U) {
			/* Complete data packet can be sent.
			 * Fill the TxFIFO until threshold is reached or all data for the transfer
			 * are sent.
			 */
			spi_stm32_send_fifo(spi, data);
		}
	}

	if (transfer_dir != STM32_SPI_HALF_DUPLEX_TX && LL_SPI_IsActiveFlag_EOT(spi)) {
		/* Full-Duplex or Half-Duplex RX cases */
		/* At the end of transfer, if transfer size is not a multiple of the FIFO
		 * threshold, some data may remain in the RxFIFO and neither the DXP nor
		 * the RXP flags are set (because the RxFIFO is not full).
		 * Read the remaining bytes here.
		 */
		if (data->rx_len > 0U) {
			spi_stm32_read_fifo(spi, data);
		}
	}
	return 0;
}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

/* Shift a SPI frame as controller. */
static int spi_stm32_shift_m(SPI_TypeDef *spi, struct spi_stm32_data *data)
{
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (ll_get_transfer_size(spi) > 0U) {
		/* Transfer size is set, use FIFO mode. */
		return spi_stm32_shift_fifo(spi, data);
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	uint32_t dir = ll_get_transfer_direction(spi);

	if (IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT)) {
		if (dir == STM32_SPI_FULL_DUPLEX) {
			/* RXNE-driven: TXE interrupt is not enabled for this path.
			 * Read the received frame, then queue the next TX frame to keep
			 * the one-frame pipeline full.
			 * After the last TX frame, re-enable TXE so the trailing TXE ISR
			 * provides a guaranteed exit point once BSY has cleared.
			 */
			if (ll_rx_is_not_empty(spi) && data->rx_len != 0U) {
				data->rx_len -= spi_stm32_read_next_frame(spi, data, 0U);
				if (data->tx_len != 0U) {
					data->tx_len -= spi_stm32_send_next_frame(spi, data, 0U);
				} else {
					/* All TX done; request one trailing TXE interrupt
					 * to exit cleanly once BSY is cleared.
					 */
					ll_enable_int_tx_empty(spi);
				}
			}
		} else if (dir == STM32_SPI_HALF_DUPLEX_TX) {
			/* Half-duplex TX: TXE flag-based handling. */
			if (ll_tx_is_not_full(spi) && data->tx_len != 0U) {
				data->tx_len -= spi_stm32_send_next_frame(spi, data, 0U);
			}
		} else if (dir == STM32_SPI_HALF_DUPLEX_RX) {
			/* Half-duplex RX: RXNE flag-based handling. */
			if (ll_rx_is_not_empty(spi) && data->rx_len != 0U) {
				data->rx_len -= spi_stm32_read_next_frame(spi, data, 0U);
			}
		} else {
			/* Unexpected transfer direction */
			return -EINVAL;
		}
	} else { /* CONFIG_SPI_STM32_INTERRUPT */
		/* Polling case */
		if (dir != STM32_SPI_HALF_DUPLEX_RX && data->tx_len != 0U) {
			while (!ll_tx_is_not_full(spi)) {
				/* NOP */
			}
			data->tx_len -= spi_stm32_send_next_frame(spi, data, 0U);
		}

		if (dir != STM32_SPI_HALF_DUPLEX_TX && data->rx_len != 0U) {
			while (!ll_rx_is_not_empty(spi)) {
				/* NOP */
			}
			data->rx_len -= spi_stm32_read_next_frame(spi, data, 0U);
		}
	} /* CONFIG_SPI_STM32_INTERRUPT */

