zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
	return 0;
}

/* Shift a SPI frame as peripheral. */
static void spi_stm32_shift_s(SPI_TypeDef *spi, struct spi_stm32_data *data)
{
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) && !defined(CONFIG_SPI_RTIO)
	if (ll_get_transfer_size(spi) > 0U) {
		/* Transfer size is set, use FIFO mode. */
		spi_stm32_shift_fifo(spi, data);
		return;
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	uint32_t dir = ll_get_transfer_direction(spi);

	if (dir != STM32_SPI_HALF_DUPLEX_RX && ll_tx_is_not_full(spi) && data->tx_len != 0U) {
		data->tx_len -= spi_stm32_send_next_frame(spi, data, 0U);
	} else {
		ll_disable_int_tx_empty(spi);
	}

	if (dir != STM32_SPI_HALF_DUPLEX_TX && ll_rx_is_not_empty(spi) && data->rx_len != 0U) {
		data->rx_len -= spi_stm32_read_next_frame(spi, data, 0U);
	}
}

/*
 * Without a FIFO, we can only shift out one frame's worth of SPI
 * data, and read the response back.
 */
static int spi_stm32_shift_frames(SPI_TypeDef *spi, struct spi_stm32_data *data)
{
	spi_operation_t operation = data->ctx.config->operation;
	int ret;

	if (SPI_OP_MODE_GET(operation) == SPI_OP_MODE_CONTROLLER) {
		ret = spi_stm32_shift_m(spi, data);
		if (ret != 0) {
			return ret;
		}
	} else {
		spi_stm32_shift_s(spi, data);
	}

	return spi_stm32_get_err(spi);
}

static void spi_stm32_cs_control(const struct device *dev, bool on __maybe_unused)
{
	__maybe_unused struct spi_stm32_data *data = dev->data;

	spi_context_cs_control(&data->ctx, on);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_subghz)
	const struct spi_stm32_config *cfg = dev->config;

	if (cfg->is_subghzspi) {
		if (on) {
			LL_PWR_SelectSUBGHZSPI_NSS();
		} else {
			LL_PWR_UnselectSUBGHZSPI_NSS();
		}
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_subghz) */
}

static void spi_stm32_msg_start(const struct device *dev, bool is_rx_empty)
{
	const struct spi_stm32_config *cfg = dev->config;
	SPI_TypeDef *spi = cfg->spi;
	__maybe_unused uint32_t transfer_dir = LL_SPI_GetTransferDirection(spi);

	ARG_UNUSED(is_rx_empty);

#if defined(CONFIG_SPI_STM32_INTERRUPT) && defined(CONFIG_SOC_SERIES_STM32H7X)
	/* Make sure IRQ is disabled to avoid any spurious IRQ to happen */
	irq_disable(cfg->irq_line);
#endif /* CONFIG_SPI_STM32_INTERRUPT && CONFIG_SOC_SERIES_STM32H7X */

	LL_SPI_Enable(spi);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	/* With the STM32MP1, STM32U5 and the STM32H7,
	 * if the device is the SPI controller,
	 * we need to enable the start of the transfer with
	 * LL_SPI_StartMasterTransfer(spi)
	 */
	if (LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER) {
		LL_SPI_StartMasterTransfer(spi);
		while (!LL_SPI_IsActiveMasterTransfer(spi)) {
			/* NOP */
		}
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

#ifdef CONFIG_SOC_SERIES_STM32H7X
	/*
	 * Add a small delay after enabling to prevent transfer stalling at high
	 * system clock frequency (see errata sheet ES0392).
	 */
	k_busy_wait(WAIT_1US);
#endif /* CONFIG_SOC_SERIES_STM32H7X */

	/* This is turned off in spi_stm32_complete(). */
	spi_stm32_cs_control(dev, true);

	if (IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT)) {
		ll_enable_int_errors(spi);

		if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
			struct spi_stm32_data *data = dev->data;

			if (ll_get_transfer_size(spi) != 0U) {
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
				/* H7 with FIFO full-duplex:
				 * Fill the TX FIFO with as many frames as possible,
				 * up to the FIFO threshold. The DXP ISR will keep the
				 * FIFO full until all data is sent.
				 */
				spi_stm32_send_fifo(spi, data);
				ll_enable_int_dxp(spi);
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */
			} else {
				/* Non-H7 or H7 without FIFO full-duplex:
				 * Seed the TX pipeline with the first frame and enable RXNE only.
				 * Each RXNE ISR reads one received frame then sends the next,
				 * keeping exactly one frame in flight.
				 * This eliminates RX overrun without busy-waiting in ISR context.
				 */
				data->tx_len -= spi_stm32_send_next_frame(spi, data, 0U);
				ll_enable_int_rx_not_empty(spi);
			}
		} else {
			if (transfer_dir != STM32_SPI_HALF_DUPLEX_TX) {
				ll_enable_int_rx_not_empty(spi);
			}

			if (transfer_dir != STM32_SPI_HALF_DUPLEX_RX) {
				ll_enable_int_tx_empty(spi);
			}
		}

		if (ll_get_transfer_size(spi) != 0U) {
			ll_enable_int_eot(spi);
		}

#if defined(CONFIG_SPI_STM32_INTERRUPT) && defined(CONFIG_SOC_SERIES_STM32H7X)
		irq_enable(cfg->irq_line);
#endif /* defined (CONFIG_SPI_STM32_INTERRUPT) && defined(CONFIG_SOC_SERIES_STM32H7X) */
	} else {
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		if (transfer_dir == STM32_SPI_FULL_DUPLEX &&
		    LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER &&
		    ll_get_transfer_size(spi) != 0U) {
			/* Polling mode: send the first frame so that only DXP and EOT are
			 * checked next.
			 */
			struct spi_stm32_data *data = dev->data;

			spi_stm32_send_fifo(spi, data);
		}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */
	}
}

#ifdef CONFIG_SPI_RTIO
/* Forward declaration for RTIO handlers convenience */
static void spi_stm32_iodev_complete(const struct device *dev, int status);
static int spi_stm32_configure(const struct device *dev,
			       const struct spi_config *config,
			       bool write, bool read);
static int32_t spi_stm32_set_transfer_size(const struct device *dev,
					   const struct spi_config *config,
					   const struct spi_buf_set *tx_bufs,
					   const struct spi_buf_set *rx_bufs);

static void spi_stm32_iodev_msg_start(const struct device *dev, struct spi_config *config,
				      const uint8_t *tx_buf, uint8_t *rx_buf, uint32_t buf_len)
{
	struct spi_stm32_data *data = dev->data;
	const uint8_t dfs = bits2bytes(config->operation);
	const uint32_t size = buf_len / dfs;
	bool use_dma = false;

	if (buf_len % dfs != 0) {
		LOG_ERR("Buffer length is not a multiple of data frame size");
		spi_stm32_iodev_complete(dev, -EINVAL);
		return;
	}

#if defined(CONFIG_SPI_STM32_DMA)
	use_dma = (data->dma_tx.dma_dev != NULL) && (data->dma_rx.dma_dev != NULL);
#endif /* CONFIG_SPI_STM32_DMA */

	data->ctx.current_tx = NULL;
	data->ctx.current_rx = NULL;

	data->ctx.tx_buf = tx_buf;
	data->ctx.rx_buf = rx_buf;
	data->ctx.tx_len = tx_buf != NULL ? size : 0;
	data->ctx.rx_len = rx_buf != NULL ? size : 0;
	data->ctx.tx_count = tx_buf != NULL ? 1 : 0;
	data->ctx.rx_count = rx_buf != NULL ? 1 : 0;

	data->ctx.sync_status = 0;
	data->ctx.owner = config;

	if (!spi_stm32_transfer_ongoing(data)) {
		spi_stm32_iodev_complete(dev, 0);
		return;
	}

	__maybe_unused const struct spi_stm32_config *cfg = dev->config;
	__maybe_unused SPI_TypeDef *spi = cfg->spi;

	if (!use_dma) {
		if (spi_stm32_set_transfer_size(dev, config, NULL, NULL) != 0) {
			spi_stm32_iodev_complete(dev, -EINVAL);
		}
	}

#ifdef CONFIG_SPI_STM32_DMA
	if (use_dma) {
#ifdef CONFIG_DCACHE
		if ((tx_buf != NULL && !stm32_buf_in_nocache((uintptr_t)tx_buf, buf_len)) ||
		    (rx_buf != NULL && !stm32_buf_in_nocache((uintptr_t)rx_buf, buf_len))) {
			LOG_ERR("SPI DMA transfers not supported on cached memory");
			spi_stm32_iodev_complete(dev, -EINVAL);
			return;
		}
#endif /* CONFIG_DCACHE */
		uint32_t transfer_dir = LL_SPI_GetTransferDirection(spi);
		size_t dma_len;
		int ret = 0;

