zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
		struct dma_config *rx_cfg = &data->dma_rx.dma_cfg;
		struct dma_config *tx_cfg = &data->dma_tx.dma_cfg;

		rx_cfg->source_data_size = rx_cfg->source_burst_length = dfs;
		rx_cfg->dest_data_size   = rx_cfg->dest_burst_length   = dfs;
		tx_cfg->source_data_size = tx_cfg->source_burst_length = dfs;
		tx_cfg->dest_data_size   = tx_cfg->dest_burst_length   = dfs;

		spi_dma_enable_requests(spi);
		LL_SPI_Enable(spi);
		spi_stm32_cs_control(dev, true);
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		LL_SPI_StartMasterTransfer(spi);
#endif /* st_stm32h7_spi */

		data->status_flags = 0;
		data->tx_len = data->ctx.tx_len;
		data->rx_len = data->ctx.rx_len;

		if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
			dma_len = spi_context_max_continuous_chunk(&data->ctx);
			ret = spi_dma_move_buffers(dev, dma_len);
		} else if (transfer_dir == STM32_SPI_HALF_DUPLEX_TX) {
			dma_len = data->ctx.tx_len;
			ret = spi_dma_move_tx_buffers(dev, dma_len);
		} else {
			dma_len = data->ctx.rx_len;
			ret = spi_dma_move_rx_buffers(dev, dma_len);
		}
		if (ret != 0) {
			LOG_ERR("Failed to start SPI DMA transfer");
			spi_stm32_iodev_complete(dev, -EIO);
		}

		return;
	}
#endif /* CONFIG_SPI_STM32_DMA */

	spi_stm32_msg_start(dev, rx_buf == NULL);
}

static void spi_stm32_iodev_start(const struct device *dev)
{
	struct spi_stm32_data *data = dev->data;
	struct spi_rtio *rtio_ctx = data->rtio_ctx;
	struct spi_dt_spec *spi_dt_spec = rtio_ctx->txn_curr->sqe.iodev->data;
	struct spi_config *spi_config = &spi_dt_spec->config;
	struct rtio_sqe *sqe = &rtio_ctx->txn_curr->sqe;

	switch (sqe->op) {
	case RTIO_OP_RX:
		spi_stm32_iodev_msg_start(dev, spi_config, NULL, sqe->rx.buf, sqe->rx.buf_len);
		break;
	case RTIO_OP_TX:
		spi_stm32_iodev_msg_start(dev, spi_config, sqe->tx.buf, NULL, sqe->tx.buf_len);
		break;
	case RTIO_OP_TINY_TX:
		spi_stm32_iodev_msg_start(dev, spi_config, sqe->tiny_tx.buf, NULL,
					  sqe->tiny_tx.buf_len);
		break;
	case RTIO_OP_TXRX:
		spi_stm32_iodev_msg_start(dev, spi_config, sqe->txrx.tx_buf, sqe->txrx.rx_buf,
					  sqe->txrx.buf_len);
		break;
	default:
		LOG_ERR("Invalid op code %d for submission %p", sqe->op, (void *)sqe);
		spi_stm32_iodev_complete(dev, -EINVAL);
		break;
	}
}

static inline int spi_stm32_iodev_prepare_start(const struct device *dev)
{
	struct spi_stm32_data *data = dev->data;
	struct spi_rtio *rtio_ctx = data->rtio_ctx;
	struct spi_dt_spec *spi_dt_spec = rtio_ctx->txn_curr->sqe.iodev->data;
	struct spi_config *spi_config = &spi_dt_spec->config;
	uint8_t op_code = rtio_ctx->txn_curr->sqe.op;
	bool write = (op_code == RTIO_OP_TX) ||
		     (op_code == RTIO_OP_TINY_TX) ||
		     (op_code == RTIO_OP_TXRX);
	bool read = (op_code == RTIO_OP_RX) ||
		    (op_code == RTIO_OP_TXRX);

#ifdef CONFIG_SPI_PERIPHERAL
	data->ctx.recv_frames = 0;
#endif /* CONFIG_SPI_PERIPHERAL */

	return spi_stm32_configure(dev, spi_config, write, read);
}

static void spi_stm32_iodev_complete(const struct device *dev, int status)
{
	struct spi_stm32_data *data = dev->data;
	struct spi_rtio *rtio_ctx = data->rtio_ctx;

	if (status == 0 && (rtio_ctx->txn_curr->sqe.flags & RTIO_SQE_TRANSACTION) != 0) {
		rtio_ctx->txn_curr = rtio_txn_next(rtio_ctx->txn_curr);
		spi_stm32_iodev_start(dev);
	} else {
		spi_stm32_cs_control(dev, false);
		while (spi_rtio_complete(rtio_ctx, status)) {
			status = spi_stm32_iodev_prepare_start(dev);
			if (status == 0) {
				spi_stm32_iodev_start(dev);
				break;
			}

			/* Clear chip select and loop to mark transfer completed with an error */
			spi_stm32_cs_control(dev, false);
		}
	}
}

static void spi_stm32_iodev_submit(const struct device *dev, struct rtio_iodev_sqe *iodev_sqe)
{
	struct spi_stm32_data *data = dev->data;
	struct spi_rtio *rtio_ctx = data->rtio_ctx;
	int err;

	if (spi_rtio_submit(rtio_ctx, iodev_sqe)) {
		err = spi_stm32_iodev_prepare_start(dev);
		if (err == 0) {
			spi_stm32_iodev_start(dev);
		} else {
			spi_stm32_iodev_complete(dev, err);
		}
	}
}
#endif /* CONFIG_SPI_RTIO */

static int spi_stm32_half_duplex_switch_direction(const struct device *dev)
{
	const struct spi_stm32_config *cfg = dev->config;
	SPI_TypeDef *spi = cfg->spi;
	struct spi_stm32_data *data = dev->data;

	if (LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER &&
	    !spi_context_tx_on(&data->ctx) && spi_context_rx_on(&data->ctx)) {
		LL_SPI_Disable(spi);
		ll_set_transfer_size(spi, data->rx_len);
		ll_set_transfer_direction(spi, STM32_SPI_HALF_DUPLEX_RX);
		LL_SPI_Enable(spi);
		spi_stm32_cs_control(dev, true);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		LL_SPI_StartMasterTransfer(spi);
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

		if (IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT)) {
			ll_enable_int_eot(spi);
			ll_enable_int_errors(spi);
			ll_enable_int_rx_not_empty(spi);
		}
	} else if (LL_SPI_GetMode(spi) == LL_SPI_MODE_SLAVE &&
		   spi_context_tx_on(&data->ctx) && !spi_context_rx_on(&data->ctx)) {
		LL_SPI_Disable(spi);

		if (!IS_ENABLED(CONFIG_SPI_RTIO)) {
			ll_set_transfer_size(spi, data->tx_len);
		}

		ll_set_transfer_direction(spi, STM32_SPI_HALF_DUPLEX_TX);
		LL_SPI_Enable(spi);

		if (IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT)) {
			if (!IS_ENABLED(CONFIG_SPI_RTIO)) {
				ll_enable_int_eot(spi);
			}
			ll_enable_int_errors(spi);
			ll_enable_int_tx_empty(spi);
		}
	}

	return 0;
}

static void spi_stm32_complete(const struct device *dev, int status)
{
	const struct spi_stm32_config *cfg = dev->config;
	SPI_TypeDef *spi = cfg->spi;
	struct spi_stm32_data *data = dev->data;

#ifdef CONFIG_SPI_RTIO
#if defined(CONFIG_SPI_STM32_INTERRUPT) && defined(CONFIG_SOC_SERIES_STM32H7X)
	/* On H7, with SPI still enabled, the ISR is always called, even if the interrupt
	 * enable register is cleared.
	 * As a workaround, disable the IRQ at NVIC level to prevent any spurious interrupt.
	 */
	irq_disable(cfg->irq_line);
#endif /* CONFIG_SPI_STM32_INTERRUPT && CONFIG_SOC_SERIES_STM32H7X */

	if (data->rtio_ctx->txn_head != NULL &&
	    ((ll_get_transfer_direction(spi) == STM32_SPI_FULL_DUPLEX) ||
	     !spi_stm32_transfer_ongoing(data))) {
		LL_SPI_ClearFlag_OVR(spi);
		ll_clear_txtf_flag(spi);
		ll_clear_eot_flag(spi);
		ll_disable_int_dxp(spi);
		ll_disable_int_eot(spi);
		spi_stm32_iodev_complete(dev, status);
		return;
	}
#endif /* CONFIG_SPI_RTIO */

	if (IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT)) {
		ll_disable_int_tx_empty(spi);
		ll_disable_int_rx_not_empty(spi);
		ll_disable_int_errors(spi);
		ll_disable_int_eot(spi);
		ll_disable_int_dxp(spi);
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_fifo)
	/* Flush RX buffer */
	while (ll_rx_is_not_empty(spi)) {
		(void) LL_SPI_ReceiveData8(spi);
	}
#endif /* compat st_stm32_spi_fifo*/

	if (LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER) {
		while (ll_spi_is_busy(spi) && LL_SPI_IsEnabled(spi)) {
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
			uint32_t width = SPI_WORD_SIZE_GET(data->ctx.config->operation);
			/* In non-FIFO mode (TSIZE == 0), the TXC flag is not raised at the end
			 * of 9, 17 or 25 bit transfer, so disable the SPI in these cases to
			 * avoid being stuck.
			 */
			if (ll_get_transfer_size(spi) == 0 &&
			    ((width == 9U) || (width == 17U) || (width == 25U))) {
				ll_disable_spi(spi);
			}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */
			if (STM32_SPI_HALF_DUPLEX_RX == ll_get_transfer_direction(spi)) {
				ll_disable_spi(spi);
			}
		}

		spi_stm32_cs_control(dev, false);
	}

