zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
	/* BSY flag is cleared when MODF flag is raised */
	if (LL_SPI_IsActiveFlag_MODF(spi)) {
		LL_SPI_ClearFlag_MODF(spi);
	}

	LL_SPI_ClearFlag_OVR(spi);
	ll_clear_txtf_flag(spi);
	ll_clear_eot_flag(spi);
	ll_set_transfer_size(spi, 0);

#ifdef CONFIG_SPI_PERIPHERAL
	bool peripheral_hd_tx = spi_context_is_peripheral(&data->ctx) &&
				(data->ctx.config->operation & SPI_HALF_DUPLEX) &&
				(ll_get_transfer_direction(spi) == STM32_SPI_HALF_DUPLEX_TX);
#else
	bool peripheral_hd_tx = false;
#endif

	/*
	 * Keep SPE enabled for SPI_HOLD_ON_CS or Peripheral Half-Duplex TX.
	 * Application must call spi_release() to disable SPE.
	 */
	if (!peripheral_hd_tx && !(data->ctx.config->operation & SPI_HOLD_ON_CS)) {
		ll_disable_spi(spi);
#if defined(CONFIG_SPI_STM32_INTERRUPT) && defined(CONFIG_SOC_SERIES_STM32H7X)
	} else {
		/* On H7, with SPI still enabled, the ISR is always called, even if the interrupt
		 * enable register is cleared.
		 * As a workaround, disable the IRQ at NVIC level.
		 */
		irq_disable(cfg->irq_line);
#endif /* CONFIG_SPI_STM32_INTERRUPT && CONFIG_SOC_SERIES_STM32H7X */
	}

	if (ll_get_transfer_direction(spi) != STM32_SPI_FULL_DUPLEX &&
	    spi_stm32_transfer_ongoing(data)) {
		spi_stm32_half_duplex_switch_direction(dev);
	} else {
		spi_context_complete(&data->ctx, dev, status);
	}
}

#ifdef CONFIG_SPI_STM32_INTERRUPT
static void spi_stm32_isr(const struct device *dev)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	SPI_TypeDef *spi = cfg->spi;
	int err;

#if defined(CONFIG_SPI_RTIO)
	/* With RTIO, an interrupt can occur even though they
	 * are all previously disabled. Ignore it then.
	 */
	if (ll_are_int_disabled(spi)) {
		return;
	}
#endif /* CONFIG_SPI_RTIO */

	/* Some spurious interrupts are triggered when SPI is not enabled; ignore them.
	 */
	if (!LL_SPI_IsEnabled(spi)) {
		return;
	}

	if (!spi_stm32_transfer_ongoing(data)) {
		if (ll_rx_is_not_empty(spi)) {
			(void) LL_SPI_ReceiveData8(spi);
		}
		LL_SPI_ClearFlag_OVR(spi);
	}

	err = spi_stm32_get_err(spi);
	if (err) {
		spi_stm32_complete(dev, err);
		return;
	}

	if (spi_stm32_transfer_ongoing(data)) {
		err = spi_stm32_shift_frames(spi, data);
		if (err) {
			spi_stm32_complete(dev, err);
			return;
		}
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_fifo) && !DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER &&
	    STM32_SPI_HALF_DUPLEX_RX == ll_get_transfer_direction(spi) &&
	    !spi_context_rx_on(&data->ctx)) {
		/* In half-duplex RX controller mode, disable the SPI as soon as the last byte is
		 * received to stop the transfer and prevent further reception of dummy bytes.
		 */
		ll_disable_spi(spi);
		spi_stm32_complete(dev, err);
		return;
	}
#endif /* st_stm32_spi_fifo && !st_stm32h7_spi */

	uint32_t transfer_dir = ll_get_transfer_direction(spi);

	if (!ll_spi_is_busy(spi) &&
	    (((transfer_dir == STM32_SPI_FULL_DUPLEX) && !spi_stm32_transfer_ongoing(data)) ||
	     ((transfer_dir == STM32_SPI_HALF_DUPLEX_TX) && !spi_context_tx_on(&data->ctx)) ||
	     ((transfer_dir == STM32_SPI_HALF_DUPLEX_RX) && !spi_context_rx_on(&data->ctx)))) {
		spi_stm32_complete(dev, err);
	}
}
#endif /* CONFIG_SPI_STM32_INTERRUPT */

static void spi_stm32_set_transfer_direction(const struct device *dev,
					     const struct spi_config *config,
					     bool write, bool read)
{
	const struct spi_stm32_config *cfg = dev->config;
	SPI_TypeDef *spi = cfg->spi;

	if (config->operation & SPI_HALF_DUPLEX) {
		/* For half-duplex transfers, if both TX and RX are active:
		 * For the controller, Tx is done first, then Rx.
		 * For the peripheral, Rx is done first, then Tx.
		 * We need to know which direction to start with in each case, hence why we need
		 * the write and read flags.
		 */
		if (SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_CONTROLLER) {
			if (write) {
				ll_set_transfer_direction(spi, STM32_SPI_HALF_DUPLEX_TX);
			} else {
				ll_set_transfer_direction(spi, STM32_SPI_HALF_DUPLEX_RX);
			}
		} else {
			if (read) {
				ll_set_transfer_direction(spi, STM32_SPI_HALF_DUPLEX_RX);
			} else {
				ll_set_transfer_direction(spi, STM32_SPI_HALF_DUPLEX_TX);
			}
		}
	} else {
		ll_set_transfer_direction(spi, STM32_SPI_FULL_DUPLEX);
	}
}

static int spi_stm32_configure(const struct device *dev,
			       const struct spi_config *config,
			       bool write, bool read)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	static const uint32_t scaler[] = {
#ifdef STM32_SPI_BAUD_RATE_PRESCALER_BYPASS
		STM32_SPI_BAUD_RATE_PRESCALER_BYPASS,
#endif /* STM32_SPI_BAUD_RATE_PRESCALER_BYPASS */
		STM32_SPI_BAUD_RATE_PRESCALER_2,
		STM32_SPI_BAUD_RATE_PRESCALER_4,
		STM32_SPI_BAUD_RATE_PRESCALER_8,
		STM32_SPI_BAUD_RATE_PRESCALER_16,
		STM32_SPI_BAUD_RATE_PRESCALER_32,
		STM32_SPI_BAUD_RATE_PRESCALER_64,
		STM32_SPI_BAUD_RATE_PRESCALER_128,
		STM32_SPI_BAUD_RATE_PRESCALER_256
	};
	SPI_TypeDef *spi = cfg->spi;
	uint32_t clock;
	int br;
	const int shift = (scaler[0] == STM32_SPI_BAUD_RATE_PRESCALER_2) ? 1 : 0;

#ifndef CONFIG_SPI_RTIO
	if (spi_context_configured(&data->ctx, config)) {
		spi_stm32_set_transfer_direction(dev, config, write, read);
		return 0;
	}
#endif /* CONFIG_SPI_RTIO */

	if (!spi_stm32_is_data_width_supported(dev, SPI_WORD_SIZE_GET(config->operation))) {
		return -ENOTSUP;
	}

	/* configure the frame format Motorola (default) or TI */
	if ((config->operation & SPI_FRAME_FORMAT_TI) == SPI_FRAME_FORMAT_TI) {
#ifdef LL_SPI_PROTOCOL_TI
		LL_SPI_SetStandard(spi, LL_SPI_PROTOCOL_TI);
#else
		LOG_ERR("Frame Format TI not supported");
		/* on stm32F1 or some stm32L1 (cat1,2) without SPI_CR2_FRF */
		return -ENOTSUP;
#endif
#if defined(LL_SPI_PROTOCOL_MOTOROLA) && defined(SPI_CR2_FRF)
	} else {
		LL_SPI_SetStandard(spi, LL_SPI_PROTOCOL_MOTOROLA);
#endif
	}

	if (IS_ENABLED(STM32_SPI_DOMAIN_CLOCK_SUPPORT) && (cfg->pclk_len > 1)) {
		if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
					   (clock_control_subsys_t) &cfg->pclken[1], &clock) < 0) {
			LOG_ERR("Failed call clock_control_get_rate(pclk[1])");
			return -EIO;
		}
	} else {
		if (clock_control_get_rate(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
					   (clock_control_subsys_t) &cfg->pclken[0], &clock) < 0) {
			LOG_ERR("Failed call clock_control_get_rate(pclk[0])");
			return -EIO;
		}
	}

	/* When the scaler table does not have the LL_SPI_BAUDRATEPRESCALER_BYPASS value, the n-th
	 * value of the table corresponds to a prescaler of value 2^(n+1). So in this case, it is
	 * necessary to add 1 (= shift variable) to the index.
	 * When the scaler table has the LL_SPI_BAUDRATEPRESCALER_BYPASS value, the n-th
	 * value of the table corresponds to a prescaler of value 2^n. So in this case, there is
	 * nothing to add (shift = 0).
	 */
	for (br = 0; br < ARRAY_SIZE(scaler); ++br) {
		uint32_t clk = clock >> (br + shift);

