zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
		if (clk <= config->frequency) {
			break;
		}
	}

	if (br >= ARRAY_SIZE(scaler)) {
		LOG_ERR("Unsupported frequency %uHz, max %uHz, min %uHz",
			config->frequency, clock >> shift,
			clock >> (ARRAY_SIZE(scaler) - 1 + shift));
		return -EINVAL;
	}

	ll_disable_spi(spi);
	LL_SPI_SetBaudRatePrescaler(spi, scaler[br]);

#if defined(SPI_CFG2_IOSWP)
	if (cfg->ioswp) {
		ll_spi_swap_sdo_sdi(spi);
	}
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (cfg->gpio_control) {
		LL_SPI_EnableGPIOControl(cfg->spi);
	} else {
		LL_SPI_DisableGPIOControl(cfg->spi);
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	if (SPI_MODE_GET(config->operation) & SPI_MODE_CPOL) {
		LL_SPI_SetClockPolarity(spi, STM32_SPI_CLOCK_POLARITY_HIGH);
	} else {
		LL_SPI_SetClockPolarity(spi, STM32_SPI_CLOCK_POLARITY_LOW);
	}

	if (SPI_MODE_GET(config->operation) & SPI_MODE_CPHA) {
		LL_SPI_SetClockPhase(spi, STM32_SPI_CLOCK_PHASE_2_EDGE);
	} else {
		LL_SPI_SetClockPhase(spi, STM32_SPI_CLOCK_PHASE_1_EDGE);
	}

	if ((config->operation & SPI_TRANSFER_LSB) != 0) {
		LL_SPI_SetTransferBitOrder(spi, LL_SPI_LSB_FIRST);
	} else {
		LL_SPI_SetTransferBitOrder(spi, LL_SPI_MSB_FIRST);
	}

	spi_stm32_set_transfer_direction(dev, config, write, read);

	LL_SPI_DisableCRC(spi);

	if (spi_cs_is_gpio(config) || cfg->soft_nss) {
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		if ((SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_CONTROLLER) &&
		    (LL_SPI_GetNSSPolarity(spi) == LL_SPI_NSS_POLARITY_LOW)) {
			LL_SPI_SetInternalSSLevel(spi, LL_SPI_SS_LEVEL_HIGH);
		}
#endif
		LL_SPI_SetNSSMode(spi, LL_SPI_NSS_SOFT);
	} else {
		if ((config->operation & SPI_OP_MODE_PERIPHERAL) != 0U) {
			LL_SPI_SetNSSMode(spi, LL_SPI_NSS_HARD_INPUT);
		} else {
			LL_SPI_SetNSSMode(spi, LL_SPI_NSS_HARD_OUTPUT);
		}
	}
	if ((config->operation & SPI_OP_MODE_PERIPHERAL) != 0U) {
		LL_SPI_SetMode(spi, LL_SPI_MODE_SLAVE);
	} else {
		LL_SPI_SetMode(spi, LL_SPI_MODE_MASTER);
	}

#if ANY_SPI_DATA_WIDTH_IS(STM32_SPI_DATA_WIDTH_FULL_4_TO_32_BIT) || \
	ANY_SPI_DATA_WIDTH_IS(STM32_SPI_DATA_WIDTH_FULL_4_TO_16_BIT)
	LL_SPI_SetDataWidth(spi, table_datawidth[SPI_WORD_SIZE_GET(config->operation) -
						 STM32_SPI_DATA_WIDTH_MIN]);
#else
	LL_SPI_SetDataWidth(spi, table_datawidth[bits2bytes(config->operation) - 1U]);
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	LL_SPI_SetMasterSSIdleness(spi, cfg->mssi_clocks);
	LL_SPI_SetInterDataIdleness(spi, cfg->midi_clocks << SPI_CFG2_MIDI_Pos);
#endif

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	bool use_dma = false;

#if defined(CONFIG_SPI_STM32_DMA)
	use_dma = (data->dma_tx.dma_dev != NULL) && (data->dma_rx.dma_dev != NULL);
#endif /* CONFIG_SPI_STM32_DMA */

	if (!use_dma) {
		/* Configure the FIFO threshold if not using DMA */
		/* Do not use bits2bytes here, we want to get 3 for 24-bit operation */
		uint8_t dfs = DIV_ROUND_UP(SPI_WORD_SIZE_GET(config->operation), 8U);

		data->fifo_threshold = MAX(1, cfg->fifo_byte_threshold / dfs);
	} else {
		/* When using DMA, set the threshold to 1. A higher value doesn't bring better
		 * performance, and is complicated to handle without using the TSIZE register.
		 * And using TSIZE requires to disable and re-enable the SPI for each new buffer
		 * in the DMA transaction.
		 */
		data->fifo_threshold = 1;
	}
	LL_SPI_SetFIFOThreshold(spi, table_fifo_threshold[data->fifo_threshold - 1]);
#elif DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_fifo)
	data->fifo_threshold = 1;
	LL_SPI_SetRxFIFOThreshold(spi, LL_SPI_RX_FIFO_TH_QUARTER);
#else
	data->fifo_threshold = 1;
#endif

	/* At this point, it's mandatory to set this on the context! */
	data->ctx.config = config;

	LOG_DBG("Installed config %p: freq %uHz (div = %u), mode %u/%u/%u, peripheral %u",
		config, clock >> br, 1 << br,
		(SPI_MODE_GET(config->operation) & SPI_MODE_CPOL) ? 1 : 0,
		(SPI_MODE_GET(config->operation) & SPI_MODE_CPHA) ? 1 : 0,
		(SPI_MODE_GET(config->operation) & SPI_MODE_LOOP) ? 1 : 0,
		config->peripheral);

	return 0;
}

static int spi_stm32_release(const struct device *dev, const struct spi_config *config)
{
	struct spi_stm32_data *data = dev->data;
	const struct spi_stm32_config *cfg = dev->config;

	spi_context_unlock_unconditionally(&data->ctx);
	ll_disable_spi(cfg->spi);

	return 0;
}

#ifndef CONFIG_SPI_RTIO
static int32_t spi_stm32_count_bufset_frames(const struct spi_config *config,
					     const struct spi_buf_set *bufs)
{
	if (bufs == NULL) {
		return 0;
	}

	uint32_t num_bytes = 0;

	for (size_t i = 0; i < bufs->count; i++) {
		num_bytes += bufs->buffers[i].len;
	}

	uint8_t dfs = bits2bytes(config->operation);

	if ((num_bytes % dfs) != 0) {
		return -EINVAL;
	}

	int frames = num_bytes / dfs;

	return frames;
}
#endif /* CONFIG_SPI_RTIO */

static int32_t spi_stm32_set_transfer_size(const struct device *dev,
					   const struct spi_config *config,
					   const struct spi_buf_set *tx_bufs,
					   const struct spi_buf_set *rx_bufs)
{
	struct spi_stm32_data *data = dev->data;
	const struct spi_stm32_config *cfg = dev->config;
	SPI_TypeDef *spi = cfg->spi;
	uint32_t transfer_dir = ll_get_transfer_direction(spi);
	int32_t tx_frames, rx_frames;

#ifdef CONFIG_SPI_RTIO
	if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
		tx_frames = spi_context_longest_current_buf(&data->ctx);
		rx_frames = tx_frames;
	} else {
		tx_frames = data->ctx.tx_len;
		rx_frames = data->ctx.rx_len;
	}
#else /* CONFIG_SPI_RTIO */
	tx_frames = spi_stm32_count_bufset_frames(config, tx_bufs);
	rx_frames = spi_stm32_count_bufset_frames(config, rx_bufs);

	if (tx_frames < 0) {
		return tx_frames;
	}

	if (rx_frames < 0) {
		return rx_frames;
	}

	if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
		uint32_t frames = MAX(tx_frames, rx_frames);

		tx_frames = frames;
		rx_frames = frames;
	}
#endif /* CONFIG_SPI_RTIO */

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (!IS_ENABLED(CONFIG_SPI_RTIO) ||
	    (SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_CONTROLLER)) {
		uint32_t frames = transfer_dir != STM32_SPI_HALF_DUPLEX_RX ? tx_frames : rx_frames;

