zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
		if (frames <= cfg->fifo_max_transfer_size) {
			if (LL_SPI_IsEnabled(spi)) {
				/* SPI needs to be disabled to set the transfer size */
				ll_disable_spi(spi);
			}

			ll_set_transfer_size(spi, (uint32_t)frames);
		} else {
			LOG_INF("Buffer size exceeds maximal supported value. "
				"Falling back to non-FIFO mode. "
				"This may result in performance degradation.");

			if (ll_get_transfer_size(spi) != 0U || data->fifo_threshold != 1) {
				if (LL_SPI_IsEnabled(spi)) {
					/* SPI needs to be disabled to set the transfer size */
					ll_disable_spi(spi);
				}

				/* Set transfer size to 0 and set the FIFO threshold to 1 frame */
				ll_set_transfer_size(spi, 0U);
				data->fifo_threshold = 1;
				LL_SPI_SetFIFOThreshold(spi, table_fifo_threshold[0]);
			}
		}
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	data->tx_len = tx_frames;
	data->rx_len = rx_frames;

	return 0;
}

#if defined(CONFIG_SPI_STM32_DMA)
#if !defined(CONFIG_SPI_RTIO)

static int wait_dma_rx_tx_done(const struct device *dev)
{
	struct spi_stm32_data *data = dev->data;
	int res = -1;
	k_timeout_t timeout;

	/*
	 * In peripheral mode we do not know when the transaction will start. Hence,
	 * it doesn't make sense to have timeout in this case.
	 */
	if (IS_ENABLED(CONFIG_SPI_PERIPHERAL) && spi_context_is_peripheral(&data->ctx)) {
		timeout = K_FOREVER;
	} else {
		timeout = K_MSEC(1000);
	}

	while (1) {
		res = k_sem_take(&data->status_sem, timeout);
		if (res != 0) {
			return res;
		}

		if ((data->status_flags & SPI_STM32_DMA_ERROR_FLAG) != 0U) {
			return -EIO;
		}

		if ((data->status_flags & SPI_STM32_DMA_DONE_FLAG) == SPI_STM32_DMA_DONE_FLAG) {
			return 0;
		}
	}

	return res;
}

#ifdef CONFIG_DCACHE
static bool is_dummy_buffer(const struct spi_buf *buf)
{
	return buf->buf == NULL;
}

static bool spi_buf_set_in_nocache(const struct spi_buf_set *bufs)
{
	for (size_t i = 0; i < bufs->count; i++) {
		const struct spi_buf *buf = &bufs->buffers[i];

		if (!is_dummy_buffer(buf) && !stm32_buf_in_nocache((uintptr_t)buf->buf, buf->len)) {
			return false;
		}
	}
	return true;
}
#endif /* CONFIG_DCACHE */
#endif /* !CONFIG_SPI_RTIO */

#if defined(CONFIG_SPI_ASYNC) || defined(CONFIG_SPI_RTIO)
static void dma_callback_async(const struct device *spi_dev, uint32_t channel, int status)
{
	struct spi_stm32_data *data = spi_dev->data;
	struct spi_context *ctx = &(data->ctx);
	const struct spi_config *config = data->ctx.owner;
	const struct spi_stm32_config *cfg = spi_dev->config;
	SPI_TypeDef *spi = cfg->spi;
	unsigned int key = irq_lock();
	int ret = 0;
	__maybe_unused size_t dma_len;

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d.", channel);
		ret = -EIO;
		goto end;
	}

	if (ctx == NULL) {
		LOG_ERR("spi_context struct ptr is NULL");
		ret = -EINVAL;
		goto end;
	}

	ret = spi_stm32_get_err(spi);
	if (ret) {
		LOG_ERR("SPI error %d", ret);
		goto end;
	}

	if (config == NULL) {
		LOG_ERR("config struct ptr is NULL");
		ret = -EINVAL;
		goto end;
	}

	/* identify the origin of this callback */
	if (channel == data->dma_tx.channel) {
		/* this part of the transfer ends */
		if (status == DMA_STATUS_BLOCK) {
			LOG_DBG("DMA Tx block is done");
		} else if (status == DMA_STATUS_COMPLETE) {
			LOG_DBG("DMA Tx transfer is done");
		}

		spi_stm32_dma_tx_done(spi_dev);
		data->status_flags |= SPI_STM32_DMA_TX_DONE_FLAG;
	} else if (channel == data->dma_rx.channel) {
		/* this part of the transfer ends */
		if (status == DMA_STATUS_BLOCK) {
			LOG_DBG("DMA Rx block is done");
		} else if (status == DMA_STATUS_COMPLETE) {
			LOG_DBG("DMA Rx transfer is done");
		}

		spi_stm32_dma_rx_done(spi_dev, config);
		data->status_flags |= SPI_STM32_DMA_RX_DONE_FLAG;
	} else {
		LOG_ERR("DMA callback channel %d is not valid.", channel);
		ret = -EINVAL;
	}

	if ((data->status_flags & SPI_STM32_DMA_DONE_FLAG) == SPI_STM32_DMA_DONE_FLAG) {
#ifndef CONFIG_SPI_RTIO
		dma_len = spi_context_max_continuous_chunk(&data->ctx);
		if (dma_len != 0U) {
			data->tx_len = data->ctx.tx_len;
			data->rx_len = data->ctx.rx_len;
			data->status_flags = 0U;
			ret = spi_dma_move_buffers(spi_dev, dma_len);

			if (ret != 0) {
				LOG_ERR("spi_dma_move_buffers err %d", ret);
				goto end;
			}

			goto unlock;
		}
#endif /* !CONFIG_SPI_RTIO */
	} else {
		goto unlock;
	}

end:
	LOG_DBG("SPI DMA transfer has ended with status %d", ret);

	/* The Config. Reg. on some mcus is write un-protected when SPI is disabled */
	LL_SPI_DisableDMAReq_TX(spi);
	LL_SPI_DisableDMAReq_RX(spi);

	if (dma_stop(data->dma_rx.dma_dev, data->dma_rx.channel)) {
		LOG_ERR("Rx dma_stop failed");
	}
	if (dma_stop(data->dma_tx.dma_dev, data->dma_tx.channel)) {
		LOG_ERR("Tx dma_stop failed");
	}

	/* spi complete relies on SPI Status Reg which cannot be disabled */
	spi_stm32_complete(spi_dev, ret);

unlock:
	irq_unlock(key);
}
#endif /* CONFIG_SPI_ASYNC || CONFIG_SPI_RTIO */

#ifndef CONFIG_SPI_RTIO
/* This function is executed in the interrupt context */
static void dma_callback_sync(const struct device *spi_dev, uint32_t channel, int status)
{
	struct spi_stm32_data *data = spi_dev->data;

	if (status < 0) {
		LOG_ERR("DMA callback error with channel %d.", channel);
		data->status_flags |= SPI_STM32_DMA_ERROR_FLAG;
	} else {
		/* identify the origin of this callback */
		if (channel == data->dma_tx.channel) {
			/* this part of the transfer ends */
			data->status_flags |= SPI_STM32_DMA_TX_DONE_FLAG;
		} else if (channel == data->dma_rx.channel) {
			/* this part of the transfer ends */
			data->status_flags |= SPI_STM32_DMA_RX_DONE_FLAG;
		} else {
			LOG_ERR("DMA callback channel %d is not valid.", channel);
			data->status_flags |= SPI_STM32_DMA_ERROR_FLAG;
		}
	}

	k_sem_give(&data->status_sem);
}
#endif /* !CONFIG_SPI_RTIO */

static void dma_callback(const struct device *dma_dev, void *arg, uint32_t channel, int status)
{
	/* arg holds the SPI device
	 * Passed in spi_stm32_dma_tx/rx_load()
	 */
	const struct device *spi_dev = (const struct device *)arg;
	__maybe_unused struct spi_stm32_data *spi_data = spi_dev->data;

	ARG_UNUSED(dma_dev);

