zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
#ifdef CONFIG_SPI_RTIO
	dma_callback_async(spi_dev, channel, status);
	return;
#else
#ifdef CONFIG_SPI_ASYNC
	if (spi_data->ctx.asynchronous) {
		dma_callback_async(spi_dev, channel, status);
		return;
	}
#endif /* CONFIG_SPI_ASYNC */
	dma_callback_sync(spi_dev, channel, status);
#endif /* CONFIG_SPI_RTIO */
}

#if !defined(CONFIG_SPI_RTIO)
static int transceive_dma(const struct device *dev,
			  const struct spi_config *config)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	SPI_TypeDef *spi = cfg->spi;
	struct dma_config *rx_cfg = &data->dma_rx.dma_cfg, *tx_cfg = &data->dma_tx.dma_cfg;
	uint32_t transfer_dir = ll_get_transfer_direction(spi);
	int ret;
	int err;
	uint8_t dfs = bits2bytes(config->operation);

	k_sem_reset(&data->status_sem);

	rx_cfg->source_data_size = rx_cfg->source_burst_length = dfs;
	rx_cfg->dest_data_size = rx_cfg->dest_burst_length = dfs;
	tx_cfg->source_data_size = tx_cfg->source_burst_length = dfs;
	tx_cfg->dest_data_size = tx_cfg->dest_burst_length = dfs;

	/* Set request before enabling (otherwise SPI CFG1 reg may be write protected) */
	spi_dma_enable_requests(spi);
	LL_SPI_Enable(spi);
	spi_stm32_cs_control(dev, true);
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_CONTROLLER) {
		LL_SPI_StartMasterTransfer(spi);
	}
#endif /* st_stm32h7_spi */

	do {
		data->status_flags = 0;

		if (transfer_dir == STM32_SPI_FULL_DUPLEX) {
			data->tx_len = data->rx_len = spi_context_max_continuous_chunk(&data->ctx);
			ret = spi_dma_move_buffers(dev, data->tx_len);
		} else if (transfer_dir == STM32_SPI_HALF_DUPLEX_TX) {
			data->tx_len = data->ctx.tx_len;
			ret = spi_dma_move_tx_buffers(dev, data->tx_len);
		} else {
			data->rx_len = data->ctx.rx_len;
			ret = spi_dma_move_rx_buffers(dev, data->rx_len);
		}

#ifdef CONFIG_SPI_ASYNC
		if (data->ctx.asynchronous) {
			return spi_context_wait_for_completion(&data->ctx);
		}
#endif /* CONFIG_SPI_ASYNC */

		ret = wait_dma_rx_tx_done(dev);
		if (ret != 0) {
			break;
		}

		spi_stm32_dma_tx_done(dev);
		spi_stm32_dma_rx_done(dev, config);

		if (transfer_dir == STM32_SPI_HALF_DUPLEX_TX &&
		    !spi_context_tx_on(&data->ctx) &&
		    spi_context_rx_on(&data->ctx)) {
			ll_disable_spi(spi);
			ll_set_transfer_direction(spi, STM32_SPI_HALF_DUPLEX_RX);
			transfer_dir = STM32_SPI_HALF_DUPLEX_RX;
			LL_SPI_Enable(spi);
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
			if (SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_CONTROLLER) {
				LL_SPI_StartMasterTransfer(spi);
			}
#endif /* st_stm32h7_spi */
		}
	} while (spi_stm32_transfer_ongoing(data));

	/* spi complete relies on SPI Status Reg which cannot be disabled */
	spi_stm32_complete(dev, ret);

#ifdef CONFIG_SPI_PERIPHERAL
	bool peripheral_hd_tx = spi_context_is_peripheral(&data->ctx) &&
				(config->operation & SPI_HALF_DUPLEX) &&
				(ll_get_transfer_direction(spi) == STM32_SPI_HALF_DUPLEX_TX);
#else
	bool peripheral_hd_tx = false;
#endif

	/* Keep SPE enabled for SPI_HOLD_ON_CS or Peripheral Half-Duplex TX */
	if (!peripheral_hd_tx && !(config->operation & SPI_HOLD_ON_CS)) {
		ll_disable_spi(spi);
	}
	/* The Config. Reg. on some mcus is write un-protected when SPI is disabled */
	LL_SPI_DisableDMAReq_TX(spi);
	LL_SPI_DisableDMAReq_RX(spi);

	err = dma_stop(data->dma_rx.dma_dev, data->dma_rx.channel);
	if (err != 0) {
		LOG_DBG("Rx dma_stop failed with error %d", err);
	}
	err = dma_stop(data->dma_tx.dma_dev, data->dma_tx.channel);
	if (err != 0) {
		LOG_DBG("Tx dma_stop failed with error %d", err);
	}

#ifdef CONFIG_SPI_PERIPHERAL
	if (spi_context_is_peripheral(&data->ctx) && ret == 0) {
		ret = data->ctx.recv_frames;
	}
#endif /* CONFIG_SPI_PERIPHERAL */

	return ret;
}
#endif /* !CONFIG_SPI_RTIO */
#endif /* CONFIG_SPI_STM32_DMA */

static int transceive(const struct device *dev,
		      const struct spi_config *config,
		      const struct spi_buf_set *tx_bufs,
		      const struct spi_buf_set *rx_bufs,
		      bool asynchronous,
		      spi_callback_t cb,
		      void *userdata)
{
	struct spi_stm32_data *data = dev->data;
	int ret;
	bool use_dma = false;
	const struct spi_stm32_config *cfg = dev->config;
	SPI_TypeDef *spi = cfg->spi;

#if defined(CONFIG_SPI_STM32_DMA)
	if ((SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_CONTROLLER) &&
	    (config->operation & SPI_HALF_DUPLEX) == 0U) {
		/* DMA can only be used for full-duplex controller mode */
		use_dma = (data->dma_tx.dma_dev != NULL) && (data->dma_rx.dma_dev != NULL);
	} else {
		LOG_ERR("SPI DMA is only supported for full-duplex controller mode");
		return -ENOTSUP;
	}
#endif /* CONFIG_SPI_STM32_DMA */

	if (tx_bufs == NULL && rx_bufs == NULL) {
		return 0;
	}

#if defined(CONFIG_DCACHE) && defined(CONFIG_SPI_STM32_DMA) && !defined(CONFIG_SPI_RTIO)
	if (use_dma &&
	    ((tx_bufs != NULL && !spi_buf_set_in_nocache(tx_bufs)) ||
	     (rx_bufs != NULL && !spi_buf_set_in_nocache(rx_bufs)))) {
		LOG_WRN_ONCE("SPI DMA transfers not supported on cached memory.");
		if (IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT)) {
			LOG_WRN_ONCE("Falling back to interrupt mode.");
		} else {
			LOG_WRN_ONCE("Falling back to polling mode.");
		}
		use_dma = false;
	}
#endif /* CONFIG_DCACHE && CONFIG_SPI_STM32_DMA && !CONFIG_SPI_RTIO */

	if (asynchronous && !IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT) && !use_dma) {
		LOG_ERR("Asynchronous transfer needs interrupts or DMA");
		return -ENOTSUP;
	}

	spi_context_lock(&data->ctx, asynchronous, cb, userdata, config);

	spi_stm32_pm_policy_state_lock_get(dev);

	/* Make sure DXP and EOT interrupts are disabled before starting the transfer */
	ll_disable_int_dxp(spi);
	ll_disable_int_eot(spi);

#ifdef CONFIG_SPI_RTIO
	ret = spi_rtio_transceive(data->rtio_ctx, config, tx_bufs, rx_bufs);
#else /* CONFIG_SPI_RTIO */
	ret = spi_stm32_configure(dev, config, tx_bufs != NULL, rx_bufs != NULL);
	if (ret != 0) {
		goto end;
	}

	/* Set buffers info */
	spi_context_buffers_setup(&data->ctx, tx_bufs, rx_bufs, bits2bytes(config->operation));

	if (!spi_stm32_transfer_ongoing(data)) {
		if (config->operation & SPI_HOLD_ON_CS) {
			spi_stm32_cs_control(dev, true);
		}
		goto end;
	}

	/* Flush RX buffer */
	while (ll_rx_is_not_empty(spi)) {
		(void) LL_SPI_ReceiveData8(spi);
	}
	LL_SPI_ClearFlag_OVR(spi);

#ifdef CONFIG_SPI_STM32_DMA
	if (use_dma) {
		ret = transceive_dma(dev, config);
		goto end;
	}
#endif /* CONFIG_SPI_STM32_DMA */

	ret = spi_stm32_set_transfer_size(dev, config, tx_bufs, rx_bufs);
	if (ret != 0) {
		goto end;
	}

	spi_stm32_msg_start(dev, rx_bufs == NULL);

	if (IS_ENABLED(CONFIG_SPI_STM32_INTERRUPT)) {
		do {
			ret = spi_context_wait_for_completion(&data->ctx);
		} while (ret == 0 && spi_stm32_transfer_ongoing(data) && !asynchronous);
	} else {
		uint32_t dir = ll_get_transfer_direction(spi);
		uint32_t mode = LL_SPI_GetMode(spi);

		while (ret == 0 && spi_stm32_transfer_ongoing(data)) {
			ret = spi_stm32_shift_frames(spi, data);

			if (ret == 0 &&
			    ((dir == STM32_SPI_HALF_DUPLEX_TX && mode == LL_SPI_MODE_MASTER
			      && data->tx_len == 0) ||
			     (dir == STM32_SPI_HALF_DUPLEX_RX && mode == LL_SPI_MODE_SLAVE
			      && data->rx_len == 0))) {
				ret = spi_stm32_half_duplex_switch_direction(dev);
				dir = ll_get_transfer_direction(spi);
			}
		}

		spi_stm32_complete(dev, ret);
	}

end:
#endif /* CONFIG_SPI_RTIO */
	if (ret != 0 || !asynchronous || IS_ENABLED(CONFIG_SPI_RTIO)) {
		spi_stm32_pm_policy_state_lock_put(dev);
	}

#ifdef CONFIG_SPI_PERIPHERAL
	if (spi_context_is_peripheral(&data->ctx) && ret == 0) {
		ret = data->ctx.recv_frames;
	}
#endif /* CONFIG_SPI_PERIPHERAL */

