zephyrproject-rtos/zephyr/drivers/spi/spi_stm32.c
	spi_context_release(&data->ctx, ret);

	return ret;
}

static int spi_stm32_transceive_sync(const struct device *dev,
				     const struct spi_config *config,
				     const struct spi_buf_set *tx_bufs,
				     const struct spi_buf_set *rx_bufs)
{
	return transceive(dev, config, tx_bufs, rx_bufs, false, NULL, NULL);
}

#ifdef CONFIG_SPI_ASYNC
static int spi_stm32_transceive_async(const struct device *dev,
				      const struct spi_config *config,
				      const struct spi_buf_set *tx_bufs,
				      const struct spi_buf_set *rx_bufs,
				      spi_callback_t cb,
				      void *userdata)
{
	return transceive(dev, config, tx_bufs, rx_bufs, true, cb, userdata);
}
#endif /* CONFIG_SPI_ASYNC */

static DEVICE_API(spi, api_funcs) = {
	.transceive = spi_stm32_transceive_sync,
#ifdef CONFIG_SPI_ASYNC
	.transceive_async = spi_stm32_transceive_async,
#endif
#ifdef CONFIG_SPI_RTIO
	.iodev_submit = spi_stm32_iodev_submit,
#endif
	.release = spi_stm32_release,
};

static int spi_stm32_pinctrl_apply(const struct device *dev, uint8_t id)
{
	const struct spi_stm32_config *config = dev->config;
	int err;

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_subghz)
	if (config->is_subghzspi) {
		/*
		 * Skip call to pinctrl_apply_state() for SUBGHZSPI.
		 * The function would error out because that node
		 * lacks pinctrl, but this is known and expected.
		 */
		return 0;
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32_spi_subghz) */

	/* Move pins to requested state */
	err = pinctrl_apply_state(config->pcfg, id);
	if ((id == PINCTRL_STATE_SLEEP) && (err == -ENOENT)) {
		/* Sleep state is optional */
		err = 0;
	}
	return err;
}

static int spi_stm32_pm_action(const struct device *dev, enum pm_device_action action)
{
	__maybe_unused struct spi_stm32_data *data = dev->data;
	const struct spi_stm32_config *config = dev->config;
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	int err;

	switch (action) {
	case PM_DEVICE_ACTION_RESUME:
		/* Configure pins for active mode */
		err = spi_stm32_pinctrl_apply(dev, PINCTRL_STATE_DEFAULT);
		if (err < 0) {
			return err;
		}
		/* enable clock */
		err = clock_control_on(clk, (clock_control_subsys_t)&config->pclken[0]);
		if (err != 0) {
			LOG_ERR("Could not enable SPI clock");
			return err;
		}
		/* (re-)init SPI context and all CS configuration */
		err = spi_context_cs_configure_all(&data->ctx);
		if (err < 0) {
			return err;
		}
		break;
	case PM_DEVICE_ACTION_SUSPEND:
		/* Stop device clock. */
		err = clock_control_off(clk, (clock_control_subsys_t)&config->pclken[0]);
		if (err != 0) {
			LOG_ERR("Could not disable SPI clock");
			return err;
		}
		/* Configure pins for sleep mode */
		return spi_stm32_pinctrl_apply(dev, PINCTRL_STATE_SLEEP);
	case PM_DEVICE_ACTION_TURN_ON:
		/* Configure pins for sleep mode */
		return spi_stm32_pinctrl_apply(dev, PINCTRL_STATE_SLEEP);
	case PM_DEVICE_ACTION_TURN_OFF:
		break;
	default:
		return -ENOTSUP;
	}

	return 0;
}

static int spi_stm32_init(const struct device *dev)
{
	struct spi_stm32_data *data __attribute__((unused)) = dev->data;
	const struct spi_stm32_config *cfg = dev->config;
	int err;

	if (IS_ENABLED(STM32_SPI_DOMAIN_CLOCK_SUPPORT) && (cfg->pclk_len > 1)) {
		err = clock_control_configure(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
					      (clock_control_subsys_t) &cfg->pclken[1],
					      NULL);
		if (err < 0) {
			LOG_ERR("Could not select SPI domain clock");
			return err;
		}
	}

#ifdef CONFIG_SPI_STM32_INTERRUPT
	cfg->irq_config(dev);
#endif /* CONFIG_SPI_STM32_INTERRUPT */

#ifdef CONFIG_SPI_STM32_DMA
	if ((data->dma_rx.dma_dev != NULL) && !device_is_ready(data->dma_rx.dma_dev)) {
		LOG_ERR("%s device not ready", data->dma_rx.dma_dev->name);
		return -ENODEV;
	}

	if ((data->dma_tx.dma_dev != NULL) && !device_is_ready(data->dma_tx.dma_dev)) {
		LOG_ERR("%s device not ready", data->dma_tx.dma_dev->name);
		return -ENODEV;
	}

	LOG_DBG("SPI with DMA transfer");

#endif /* CONFIG_SPI_STM32_DMA */

#ifdef CONFIG_SPI_RTIO
	spi_rtio_init(data->rtio_ctx, dev);
#endif /* CONFIG_SPI_RTIO */

	spi_context_unlock_unconditionally(&data->ctx);

	return pm_device_driver_init(dev, spi_stm32_pm_action);
}

#ifdef CONFIG_SPI_STM32_INTERRUPT
#define STM32_SPI_IRQ_HANDLER_DECL(id)						\
	static void spi_stm32_irq_config_func_##id(const struct device *dev)

#define STM32_SPI_IRQ_HANDLER_FUNC(id)						\
	.irq_config = spi_stm32_irq_config_func_##id,				\
	IF_ENABLED(CONFIG_SOC_SERIES_STM32H7X,					\
		   (.irq_line = DT_INST_IRQN(id),))

#define STM32_SPI_IRQ_HANDLER(id)						\
	static void spi_stm32_irq_config_func_##id(const struct device *dev)	\
	{									\
		IRQ_CONNECT(DT_INST_IRQN(id),					\
			    DT_INST_IRQ(id, priority),				\
			    spi_stm32_isr, DEVICE_DT_INST_GET(id), 0);		\
		irq_enable(DT_INST_IRQN(id));					\
	}
#else
#define STM32_SPI_IRQ_HANDLER_DECL(id)
#define STM32_SPI_IRQ_HANDLER_FUNC(id)
#define STM32_SPI_IRQ_HANDLER(id)
#endif /* CONFIG_SPI_STM32_INTERRUPT */

#define SPI_DMA_CHANNEL_INIT(index, dir, dir_cap, src_dev, dest_dev)		\
	.dma_dev = DEVICE_DT_GET(STM32_DMA_CTLR(index, dir)),			\
	.channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),		\
	.dma_cfg = {								\
		.dma_slot = STM32_DMA_SLOT(index, dir, slot),			\
		.channel_direction = STM32_DMA_CONFIG_DIRECTION(		\
					STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
		.source_data_size = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(	\
					STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
		.dest_data_size = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(	\
					STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
		/* use single transfers (burst length = data size) */		\
		.source_burst_length = STM32_DMA_CONFIG_##src_dev##_DATA_SIZE(	\
					STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
		.dest_burst_length = STM32_DMA_CONFIG_##dest_dev##_DATA_SIZE(	\
					STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
		.channel_priority = STM32_DMA_CONFIG_PRIORITY(			\
					STM32_DMA_CHANNEL_CONFIG(index, dir)),	\
		.dma_callback = dma_callback,					\
		.block_count = 2,						\
	},									\
	.src_addr_increment = STM32_DMA_CONFIG_##src_dev##_ADDR_INC(		\
				STM32_DMA_CHANNEL_CONFIG(index, dir)),		\
	.dst_addr_increment = STM32_DMA_CONFIG_##dest_dev##_ADDR_INC(		\
				STM32_DMA_CHANNEL_CONFIG(index, dir)),		\
	.fifo_threshold = STM32_DMA_FEATURES_FIFO_THRESHOLD(		\
				STM32_DMA_FEATURES(index, dir)),		\


#ifdef CONFIG_SPI_STM32_DMA
#define SPI_DMA_CHANNEL(id, dir, DIR, src, dest)				\
	.dma_##dir = {								\
		COND_CODE_1(DT_INST_DMAS_HAS_NAME(id, dir),			\
			    (SPI_DMA_CHANNEL_INIT(id, dir, DIR, src, dest)),	\
			    (NULL))						\
		},
#define SPI_DMA_STATUS_SEM(id)							\
	.status_sem = Z_SEM_INITIALIZER(spi_stm32_dev_data_##id.status_sem, 0, 1),
#else
#define SPI_DMA_CHANNEL(id, dir, DIR, src, dest)
#define SPI_DMA_STATUS_SEM(id)
#endif /* CONFIG_SPI_STM32_DMA */

#define SPI_STM32_CHECK_FIFO(id)								\
	IF_ENABLED(DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi),					\
		(BUILD_ASSERT(DT_INST_PROP(id, st_fifo_threshold) <= DT_INST_PROP(id, fifo_size),\
		     "FIFO threshold should be less than or equal to FIFO size.")))

/* clang-format off */
#define STM32_SPI_INIT(id)							\
	SPI_STM32_CHECK_FIFO(id);						\
										\
	STM32_SPI_IRQ_HANDLER_DECL(id);						\
										\
	PINCTRL_DT_INST_DEFINE(id);						\
										\
	static const struct stm32_pclken pclken_##id[] =			\
						       STM32_DT_INST_CLOCKS(id);\
										\
	static const struct spi_stm32_config spi_stm32_cfg_##id = {		\
		.spi = (SPI_TypeDef *)DT_INST_REG_ADDR(id),			\
		.pclken = pclken_##id,						\
		.pclk_len = DT_INST_NUM_CLOCKS(id),				\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(id),			\
		.datawidth = CONCAT(STM32_SPI_DATA_WIDTH_,			\
			DT_INST_STRING_UPPER_TOKEN(id, st_spi_data_width)),	\
		.ioswp = DT_INST_PROP(id, ioswp),				\
		STM32_SPI_IRQ_HANDLER_FUNC(id)					\
		IF_ENABLED(DT_INST_NODE_HAS_COMPAT(id, st_stm32_spi_subghz),	\
			   (.is_subghzspi = true,))				\
		IF_ENABLED(DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi), (		\
			.gpio_control =	DT_INST_PROP(id, st_gpio_control),	\
			.midi_clocks = DT_INST_PROP(id, midi_clock),		\
			.mssi_clocks = DT_INST_PROP(id, mssi_clock),		\
			.fifo_size = DT_INST_PROP(id, fifo_size),		\
			.fifo_max_transfer_size = DT_INST_PROP(id, fifo_max_transfer_size),	\
			.fifo_byte_threshold = DT_INST_PROP(id, st_fifo_threshold),		\
		))								\
		.soft_nss = DT_INST_PROP(id, st_soft_nss),			\
	};									\
										\
	IF_ENABLED(CONFIG_SPI_RTIO,						\
		   (SPI_RTIO_DEFINE(spi_stm32_rtio_##id,			\
				    CONFIG_SPI_STM32_RTIO_SQ_SIZE,		\
				    CONFIG_SPI_STM32_RTIO_CQ_SIZE)))		\
										\
	static struct spi_stm32_data spi_stm32_dev_data_##id = {		\
		SPI_CONTEXT_INIT_LOCK(spi_stm32_dev_data_##id, ctx),		\
		SPI_CONTEXT_INIT_SYNC(spi_stm32_dev_data_##id, ctx),		\
		SPI_DMA_CHANNEL(id, rx, RX, PERIPHERAL, MEMORY)			\
		SPI_DMA_CHANNEL(id, tx, TX, MEMORY, PERIPHERAL)			\
		SPI_DMA_STATUS_SEM(id)						\
		SPI_CONTEXT_CS_GPIOS_INITIALIZE(DT_DRV_INST(id), ctx)		\
		IF_ENABLED(CONFIG_SPI_RTIO, (.rtio_ctx = &spi_stm32_rtio_##id,))\
	};									\
										\
	PM_DEVICE_DT_INST_DEFINE(id, spi_stm32_pm_action);			\
										\
	SPI_DEVICE_DT_INST_DEFINE(id, spi_stm32_init,				\
				  PM_DEVICE_DT_INST_GET(id),			\
				  &spi_stm32_dev_data_##id,			\
				  &spi_stm32_cfg_##id,				\
				  POST_KERNEL, CONFIG_SPI_INIT_PRIORITY,	\
				  &api_funcs);					\
										\
	STM32_SPI_IRQ_HANDLER(id)
/* clang-format on */

DT_INST_FOREACH_STATUS_OKAY(STM32_SPI_INIT)
